[{"title":"Hamburg","postings":[{"additionalPlain":"ABOUT OUR COMMUNITY\n\nIn our Engineering Hubs in Hamburg and Lisbon you will meet people from all over the world – different cultures, origins, languages, genders, and lifestyles. We love diversity and openness.\n\nIf you ask anyone why they work here, it's pretty likely that they will say “because of the people” and “because I've never learned so much in my life”. Our company is a place where you can be yourself, aim high, care for each other, and grow without limits.\n\nIn our centrally located offices, our community meets not only to work, but also to play pool and have fun with team members and find some new friends. \n\nBut more importantly, we offer you the opportunity to be responsible for realizing a complete project from the idea to the implementation, working on interesting tasks with intelligent people.\n\nWANT TO JOIN US?\n\nSend us your complete application (CV and references) via our applicant portal. If you have any questions about your application or the application process, please contact Lena Oechtering personally at +49 40/890584-0.\n\nPrivacy Policy\n","additional":"<div><b style=\"font-size: 12pt\">ABOUT OUR COMMUNITY</b></div><div><br></div><div><span style=\"font-size: 12pt\">In our Engineering Hubs in Hamburg and Lisbon you will meet people from all over the world – different cultures, origins, languages, genders, and lifestyles. We love diversity and openness.</span></div><div><br></div><div><span style=\"font-size: 12pt\">If you ask anyone why they work here, it's pretty likely that they will say “because of the people” and “because I've never learned so much in my life”. Our company is a place where you can be yourself, aim high, care for each other, and grow without limits.</span></div><div><br></div><div><span style=\"font-size: 12pt\">In our centrally located offices, our community meets not only to work, but also to play pool and have fun with team members and find some new friends.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 12pt\">But more importantly, we offer you the opportunity to be responsible for realizing a complete project from the idea to the implementation, working on interesting tasks with intelligent people.</span></div><div><br></div><div><b style=\"font-size: 12pt\">WANT TO JOIN US?</b></div><div><br></div><div><span style=\"font-size: 12pt\">Send us your complete application (CV and references) via our applicant portal. If you have any questions about your application or the application process, please contact Lena Oechtering personally at +49 40/890584-0.</span></div><div><br></div><div><a href=\"https://freiheit.com/privacy_policy/#lever\" class=\"postings-link\">Privacy Policy</a></div>","categories":{"commitment":"Full-time","location":"Hamburg","team":"People, Commercial and Organization"},"createdAt":1676046546508,"descriptionPlain":"ABOUT OUR COMPANY\n\nfreiheit.com is an internet pioneer, founded in Hamburg in 1999 and developing digital online products for international clients. We have completed hundreds of projects. Our digital products are used by millions of users with thousands of requests per second. Each product has significant strategic relevance for our clients and is therefore crucial for their economic success. Failure is not an option. We are known for our high reputation in the market and highly valued as an employer for our strong and unique sense of community.\n\nFor over 25 years, we have been working for the “Who's Who” of German and European industrial and commercial companies – across all sectors. Trade, automotive, e-commerce, healthcare, and more. We have ambitious targets for growth in the coming years and are therefore expanding our international team, especially in the commercial area.\n\nWe currently have a team of 200 people from 29 nations in our Engineering Hubs in Hamburg and Lisbon. For both hubs, we are looking for ambitious and well-qualified business experts with excellent university degrees. Read below to find out what our expectations are, and what you can expect from us.\n\nWe look forward to receiving your application!\n","description":"<div><b style=\"font-size: 12pt\">ABOUT OUR COMPANY</b></div><div><br></div><div><span style=\"font-size: 12pt\">freiheit.com is an internet pioneer, founded in Hamburg in 1999 and developing digital online products for international clients. We have completed hundreds of projects. Our digital products are used by millions of users with thousands of requests per second. Each product has significant strategic relevance for our clients and is therefore crucial for their economic success. Failure is not an option. We are known for our high reputation in the market and highly valued as an employer for our strong and unique sense of community.</span></div><div><br></div><div><span style=\"font-size: 12pt\">For over 25 years, we have been working for the “Who's Who” of German and European industrial and commercial companies – across all sectors. Trade, automotive, e-commerce, healthcare, and more. We have ambitious targets for growth in the coming years and are therefore expanding our international team, especially in the commercial area.</span></div><div><br></div><div><span style=\"font-size: 12pt\">We currently have a team of 200 people from 29 nations in our Engineering Hubs in Hamburg and Lisbon. For both hubs, we are looking for ambitious and well-qualified business experts with excellent university degrees. Read below to find out what our expectations are, and what you can expect from us.</span></div><div><br></div><div><span style=\"font-size: 12pt\">We look forward to receiving your application!</span></div>","id":"f0434644-f31f-4585-999d-93f60cd6a3a4","lists":[{"text":"ABOUT YOUR JOB","content":"<li>You are responsible for the commercial management of international software projects – you work with a highly qualified management team led by our founders.</li><li>You maintain and expand our client relationships with a clear vision of the future.&nbsp;</li><li>You are responsible for the success of projects, understand their business goals and the derived product strategy, and support our software engineers in implementing them. In doing so, you lead several teams in a highly agile environment and ensure effective, reliable and data-driven product development.</li><li>At the same time, you keep an eye on our business and growth targets and also help ensure that we achieve them through long-term project planning.</li>"},{"text":"ABOUT YOU","content":"<li>You are an entrepreneur at heart and make the economic success of your projects as well as the success and satisfaction of your customers your top priority.</li><li>You have a first-class university degree in the field of economics and can prove your first years of professional experience as an account manager – preferably in a start-up.</li><li>You are enthusiastic about digital technology.</li><li>You think and act like an entrepreneur: you are independent, driven by numbers and data, and solution-oriented.</li><li>You are confident in dealing with numbers, have an analytical mindset and are fluent in German and English.</li><li>Your outstanding communication skills and your intuition for our customer's’ needs enable you to confidently and convincingly work with top management on client side.</li><li>You are committed to improving yourself and learning something new every day. You enjoy thinking ahead and contributing to the decision-making process. You accept challenges without losing sight of possible risks.&nbsp;You are honest and have a sense of humor. </li><li>You are captivating, charming and assertive. You don't want just any job, you want to make a difference with your ideas and your skills.</li>"}],"text":"Account Manager (m/f/d)","country":"DE","workplaceType":"hybrid","hostedUrl":"https://jobs.lever.co/freiheit-2/f0434644-f31f-4585-999d-93f60cd6a3a4","applyUrl":"https://jobs.lever.co/freiheit-2/f0434644-f31f-4585-999d-93f60cd6a3a4/apply"},{"additionalPlain":"ÜBER UNSERE COMMUNITY\n\nÜber 85% unserer Kollegen sind Engineers mit einem exzellenten Hochschulabschluss in Computerwissenschaft, Mathematik oder Physik. Ein kleines schlagkräftiges Commercial Team begleitet die Software-Entwicklung, indem sie alle kaufmännischen Prozesse rund um unsere Projekte effektiv organisiert.\n\nUnser offenes Büro liegt im Herzen von Hamburg mitten auf St. Pauli. Zentraler Treffpunkt ist 6Fwd - unsere Social Area mit Panoramablick über Hamburg. Hier finden unsere Events wie HackerTalks, Rollenspiel- und Poker-Abende oder Jam-Sessions statt. Und natürlich unsere legendären Grill-Parties und Culture Nights.\n\nAus aktuellem Anlass arbeiten wir größtenteils im Home Office - mit regelmäßigen All-Hands-Meetings und virtuellen Team Events. Unsere Engineering Hubs in Hamburg sowie in Lissabon sind jedoch geöffnet und stehen für Termine und ausgewählte Events zur Verfügung.\n\nDAZUGEHÖREN?\n\nDann schick uns Deine vollständigen Bewerbungsunterlagen (Anschreiben, Lebenslauf und Zeugnisse) über unser Bewerberportal. Bei Fragen zu Deiner Bewerbung oder dem Bewerbungsprozess steht Dir Lena Oechtering unter +49 40/890584-0 persönlich zur Verfügung.\n\nPrivacy Policy\n","additional":"<div><b style=\"font-size: 11pt\">ÜBER UNSERE COMMUNITY</b></div><div><br></div><div><span style=\"font-size: 11pt\">Über 85% unserer Kollegen sind Engineers mit einem exzellenten Hochschulabschluss in Computerwissenschaft, Mathematik oder Physik. Ein kleines schlagkräftiges Commercial Team begleitet die Software-Entwicklung, indem sie alle kaufmännischen Prozesse rund um unsere Projekte effektiv organisiert.</span></div><div><br></div><div><span style=\"font-size: 11pt\">Unser offenes Büro liegt im Herzen von Hamburg mitten auf St. Pauli. Zentraler Treffpunkt ist 6Fwd - unsere Social Area mit Panoramablick über Hamburg. Hier finden unsere Events wie HackerTalks, Rollenspiel- und Poker-Abende oder Jam-Sessions statt. Und natürlich unsere legendären Grill-Parties und Culture Nights.</span></div><div><br></div><div><span style=\"font-size: 11pt\">Aus aktuellem Anlass arbeiten wir größtenteils im Home Office - mit regelmäßigen All-Hands-Meetings und virtuellen Team Events. Unsere Engineering Hubs in Hamburg sowie in Lissabon sind jedoch geöffnet und stehen für Termine und ausgewählte Events zur Verfügung.</span></div><div><br></div><div><b style=\"font-size: 11pt\">DAZUGEHÖREN?</b></div><div><br></div><div><span style=\"font-size: 11pt\">Dann schick uns Deine vollständigen Bewerbungsunterlagen (Anschreiben, Lebenslauf und Zeugnisse) über unser Bewerberportal. Bei Fragen zu Deiner Bewerbung oder dem Bewerbungsprozess steht Dir Lena Oechtering unter +49 40/890584-0 persönlich zur Verfügung.</span></div><div><br></div><div><a href=\"https://freiheit.com/privacy_policy/#lever\" class=\"postings-link\">Privacy Policy</a></div>","categories":{"commitment":"Full-time","location":"Hamburg","team":"People, Commercial and Organization"},"createdAt":1627460981760,"descriptionPlain":"ÜBER UNS\n\nDie Software-Entwickler von freiheit.com entwickeln seit 1999 hochverfügbare und skalierbare Software-Systeme. Wir sind Internet-Pioniere und haben für unsere Kunden bereits Hunderte von Projekten realisiert, die von Millionen von Nutzern mit Tausenden von Anfragen pro Sekunde genutzt werden.\n\nWir arbeiten dabei sowohl für erfolgreiche Mittelständler als auch für das “Who's Who” der deutschen Industrie - und quer über alle Branchen. Handel, Automotive, E-Commerce, Energy - bei den Projekten für unsere Kunden sind wir immer bereit, Neues zu lernen. \n\nIn den letzten zwei Jahrzehnten haben wir uns ständig neu erfunden. Selbstverbesserung und Lernen sind tief in der DNA unseres Unternehmens und in der Persönlichkeit aller unserer Teammitglieder verwurzelt. Wir gehen ständig neue und interessante Probleme an und erarbeiten sehr häufig Lösungen, die es so zuvor noch nicht gegeben hat.\n\nWir sind eine außergewöhnliche, innovative und leistungsstarke Engineering Company. 85 % unserer Kolleginnen und Kollegen sind Engineers mit einem Hintergrund in Informatik, Physik oder Mathematik. Viele von ihnen haben einen Machine-Learning-Background.\n\nÜBER DEINEN JOB\n\nAls Business Associate arbeitest Du eng mit dem Management Team (Business Directors und Engineering Directors) von freiheit.com zusammen. Du lernst wie ein erfolgreicher Unternehmer zu denken und zu handeln und übernimmst Schritt für Schritt mehr Verantwortung.\n\nDu verstehst die Geschäftsziele unserer Kunden sowie die abgeleitete Produktstrategie und unterstützt unsere Software Engineers bei der Umsetzung. Dabei arbeitest Du mit mehreren Teams in einem hochagilen Umfeld zusammen und bereitest alles für eine effektive, zuverlässige und zahlengetriebene Produktentwicklung vor.\n\nDu hast stets Ausrichtung und Fortschritt Deiner Projekte im Blick und hilfst Deinen Teams, die Ziele Deiner Kunden zu verstehen und umzusetzen.\n\nDu bist erster Ansprechpartner für die operativen Fragestellungen unserer Kunden und sorgst für reibungslose Abläufe im kommerziellen Bereich. Hier arbeitest Du von der ersten Vertragsverhandlung bis zur Projektfinalisierung eng mit dem Business Director zusammen und hältst ihm den Rücken frei.\n\nDu unterstützt die Business Directors dabei, potenzielle neue Kunden zu identifizieren, unterstützt bei der Entwicklung neuer Opportunities und dabei, unsere bestehenden Kundenbeziehungen langfristig auszubauen.\n\nDu begleitest den Business Directors in persönlichen Feedbackgesprächen, individuellen Coachings sowie beim Recruiting und unterstützt ihn dabei, die Unternehmens- und Wachstumsziele zu erreichen. So wirst Du Teil unserer einzigartigen Engineering-Kultur.\n\nDu unterstützt das ManagementTeam bei der Weiterentwicklung der nationalen und internationalen Wachstumsstrategie sowie beim Auf- und Ausbau unserer internationalen Standorte - bereits heute in Lissabon und zukünftig weltweit. \n\nÜBER DICH\n\nDu möchtest von Grund auf lernen, wie ein Unternehmer zu denken und zu handeln. Dabei steht der wirt­schaftliche Erfolg Deiner Projekte sowie der Erfolg Deiner Kunden für Dich an erster Stelle. \n\nDarüber hinaus überzeugst Du uns mit folgenden Skills:\n","description":"<div><span style=\"font-size: 11pt\">ÜBER UNS</span></div><div><br></div><div><span style=\"font-size: 12pt\">Die Software-Entwickler von </span><a href=\"http://freiheit.com\" style=\"font-size: 12pt\" class=\"postings-link\">freiheit.com</a><span style=\"font-size: 12pt\"> entwickeln seit 1999 hochverfügbare und skalierbare Software-Systeme. Wir sind Internet-Pioniere und haben für unsere Kunden bereits Hunderte von Projekten realisiert, die von Millionen von Nutzern mit Tausenden von Anfragen pro Sekunde genutzt werden.</span></div><div><br></div><div><span style=\"font-size: 12pt\">Wir arbeiten dabei sowohl für erfolgreiche Mittelständler als auch für das “Who's Who” der deutschen Industrie - und quer über alle Branchen. Handel, Automotive, E-Commerce, Energy - bei den Projekten für unsere Kunden sind wir immer bereit, Neues zu lernen. </span></div><div><br></div><div><span style=\"font-size: 12pt\">In den letzten zwei Jahrzehnten haben wir uns ständig neu erfunden. Selbstverbesserung und Lernen sind tief in der DNA unseres Unternehmens und in der Persönlichkeit aller unserer Teammitglieder verwurzelt. Wir gehen ständig neue und interessante Probleme an und erarbeiten sehr häufig Lösungen, die es so zuvor noch nicht gegeben hat.</span></div><div><br></div><div><span style=\"font-size: 12pt\">Wir sind eine außergewöhnliche, innovative und leistungsstarke Engineering Company. 85 % unserer Kolleginnen und Kollegen sind Engineers mit einem Hintergrund in Informatik, Physik oder Mathematik. Viele von ihnen haben einen Machine-Learning-Background.</span></div><div><br></div><div><span style=\"font-size: 12pt\">ÜBER DEINEN JOB</span></div><div><br></div><div><span style=\"font-size: 12pt\">Als Business Associate arbeitest Du eng mit dem Management Team (Business Directors und Engineering Directors) von </span><a href=\"http://freiheit.com\" style=\"font-size: 12pt\" class=\"postings-link\">freiheit.com</a><span style=\"font-size: 12pt\"> zusammen. Du lernst wie ein erfolgreicher Unternehmer zu denken und zu handeln und übernimmst Schritt für Schritt mehr Verantwortung.</span></div><div><br></div><div><span style=\"font-size: 12pt\">Du verstehst die Geschäftsziele unserer Kunden sowie die abgeleitete Produktstrategie und unterstützt unsere Software Engineers bei der Umsetzung. Dabei arbeitest Du mit mehreren Teams in einem hochagilen Umfeld zusammen und bereitest alles für eine effektive, zuverlässige und zahlengetriebene Produktentwicklung vor.</span></div><div><br></div><div><span style=\"font-size: 12pt\">Du hast stets Ausrichtung und Fortschritt Deiner Projekte im Blick und hilfst Deinen Teams, die Ziele Deiner Kunden zu verstehen und umzusetzen.</span></div><div><br></div><div><span style=\"font-size: 12pt\">Du bist erster Ansprechpartner für die operativen Fragestellungen unserer Kunden und sorgst für reibungslose Abläufe im kommerziellen Bereich. Hier arbeitest Du von der ersten Vertragsverhandlung bis zur Projektfinalisierung eng mit dem </span><span style=\"font-size: 16px\">Business Director</span><span style=\"font-size: 12pt\"> zusammen und hältst ihm den Rücken frei.</span></div><div><br></div><div><span style=\"font-size: 12pt\">Du unterstützt die </span><span style=\"font-size: 16px\">Business Directors</span><span style=\"font-size: 12pt\"> dabei, potenzielle neue Kunden zu identifizieren, unterstützt bei der Entwicklung neuer Opportunities und dabei, unsere bestehenden Kundenbeziehungen langfristig auszubauen.</span></div><div><br></div><div><span style=\"font-size: 12pt\">Du begleitest den </span><span style=\"font-size: 16px\">Business Directors</span><span style=\"font-size: 12pt\"> in persönlichen Feedbackgesprächen, individuellen Coachings sowie beim Recruiting und unterstützt ihn dabei, die Unternehmens- und Wachstumsziele zu erreichen. So wirst Du Teil unserer einzigartigen Engineering-Kultur.</span></div><div><br></div><div><span style=\"font-size: 12pt\">Du unterstützt das ManagementTeam bei der Weiterentwicklung der nationalen und internationalen Wachstumsstrategie sowie beim Auf- und Ausbau unserer internationalen Standorte - bereits heute in Lissabon und zukünftig weltweit.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 16px\">ÜBER DICH</span></div><div><br></div><div>Du möchtest von Grund auf lernen, wie ein Unternehmer zu denken und zu handeln. Dabei steht der wirt­schaftliche Erfolg Deiner Projekte sowie der Erfolg Deiner Kunden für Dich an erster Stelle. </div><div><br></div><div>Darüber hinaus überzeugst Du uns mit folgenden Skills:</div>","id":"91b623af-cd08-42da-afa2-e7111aeda236","lists":[{"text":"","content":"<li>Du hast einen erstklassigen Hochschulabschluss im Bereich der Wirt­schafts­wissenschaften, gerne auch einen MBA. Ggf. kannst Du erste Berufserfahrung im Bereich agiler Software-Entwicklung nachweisen.&nbsp;</li><li>Du bist begeistert von digitaler Technologie und hast ein Grundverständnis von modernem Software Engineering.</li><li>Du bist 100 % zuverlässig und kannst eigen­ver­antwortlich, zahlengetrieben und lösungsorientiert handeln.</li><li>Du bist sicher im Umgang mit Zahlen, verfügst über eine analy­ti­sche Denkweise und sprichst verhandlungssicheres Englisch.</li><li>Dein besonderes Kommuni­ka­tionsvermögen und Dein Gespür für unsere Kunden ermöglichen Dir ein souveränes und überzeugendes Auftreten.</li><li>Du hast Spaß daran, gelegentlich zu unseren Kunden, Partnern und anderen Offices zu reisen.&nbsp;</li><li>Du bist bereit, jeden Tag etwas Neues zu lernen und Dich weiterzuentwickeln. Du hast Spaß am Mitdenken und Mitentscheiden. Du nimmst Herausforderungen an, ohne die Risiken aus dem Auge zu verlieren. Du bist ehrlich und hast Humor. Du bist mitreißend, charmant und durchsetzungsstark. Du willst nicht irgendeinen Job, sondern Du willst mit Deinen Ideen und Deinem Können etwas bewegen.&nbsp;</li>"}],"text":"Business Associate (m/w/d)","country":"DE","workplaceType":"onsite","hostedUrl":"https://jobs.lever.co/freiheit-2/91b623af-cd08-42da-afa2-e7111aeda236","applyUrl":"https://jobs.lever.co/freiheit-2/91b623af-cd08-42da-afa2-e7111aeda236/apply"},{"additionalPlain":"ABOUT OUR COMMUNITY\n\nIn our engineering hubs in Hamburg and Lisbon, you will meet people from all over the world – different cultures, origins, languages, genders and lifestyles. We love diversity and openness.\n\nIf you ask anyone why they work here, it's pretty likely that they will say “because of the people” and “because I've never learned so much in my life”. Our company is a place where you can be yourself, aim high, care for each other and grow without limits.\n\nIn our centrally located offices, our community meets not only to work, but also to play pool and have fun with team members and find some new friends. But more importantly, we offer you the opportunity to be responsible for realizing a complete project from the idea to the implementation, working on interesting tasks with intelligent people.\n\nWANT TO JOIN US?\n\nSend us your complete application (CV and references) via our applicant portal. If you have any questions about your application or the application process, please contact Lena Oechtering personally at +49 40/890584-0.\n\nPrivacy policy\n","additional":"<div><b style=\"font-size: 12pt\">ABOUT OUR COMMUNITY</b></div><div><br></div><div><span style=\"font-size: 12pt\">In our engineering hubs in Hamburg and Lisbon, you will meet people from all over the world – different cultures, origins, languages, genders and lifestyles. We love diversity and openness.</span></div><div><br></div><div><span style=\"font-size: 12pt\">If you ask anyone why they work here, it's pretty likely that they will say “because of the people” and “because I've never learned so much in my life”. Our company is a place where you can be yourself, aim high, care for each other and grow without limits.</span></div><div><br></div><div><span style=\"font-size: 12pt\">In our centrally located offices, our community meets not only to work, but also to play pool and have fun with team members and find some new friends.&nbsp;But more importantly, we offer you the opportunity to be responsible for realizing a complete project from the idea to the implementation, working on interesting tasks with intelligent people.</span></div><div><br></div><div><b style=\"font-size: 12pt\">WANT TO JOIN US?</b></div><div><br></div><div><span style=\"font-size: 12pt\">Send us your complete application (CV and references) via our applicant portal. If you have any questions about your application or the application process, please contact Lena Oechtering personally at +49 40/890584-0.</span></div><div><br></div><div><a href=\"https://freiheit.com/privacy_policy/#lever\" class=\"postings-link\">Privacy policy</a></div>","categories":{"commitment":"Full-time","location":"Hamburg","team":"People, Commercial and Organization"},"createdAt":1592473226939,"descriptionPlain":"ABOUT OUR COMPANY\n\nfreiheit.com is an internet pioneer, founded in Hamburg in 1999 and developing digital online products for international clients. We have completed hundreds of projects. Our digital products are used by millions of users with thousands of requests per second. Each product has significant strategic relevance for our clients and is therefore crucial for their economic success. Failure is not an option. We are known for our high reputation in the market and highly valued as an employer for our strong and unique sense of community.\n\nFor over 24 years, we have been working for the “Who's Who” of German and European industrial and commercial companies – across all sectors. Trade, automotive, e-commerce, healthcare and more. We have ambitious targets for growth in the coming years and are therefore expanding our international team, especially in the commercial area.\n\nWe currently have a team of 200 people from 29 nations in our engineering hubs in Hamburg and Lisbon. For both hubs, we are looking for ambitious and well-qualified business experts with an excellent university degree. Read below to find out what our expectations are, and what you can expect from us.\n\nWe look forward to receiving your application!\n","description":"<div><b style=\"font-size: 12pt\">ABOUT OUR COMPANY</b></div><div><br></div><div><a href=\"http://COMPANYfreiheit.com\" style=\"font-size: 12pt\" class=\"postings-link\">freiheit.com</a><span style=\"font-size: 12pt\"> is an internet pioneer, founded in Hamburg in 1999 and developing digital online products for international clients. We have completed hundreds of projects. Our digital products are used by millions of users with thousands of requests per second. Each product has significant strategic relevance for our clients and is therefore crucial for their economic success. Failure is not an option. We are known for our high reputation in the market and highly valued as an employer for our strong and unique sense of community.</span></div><div><br></div><div><span style=\"font-size: 12pt\">For over 24 years, we have been working for the “Who's Who” of German and European industrial and commercial companies – across all sectors. Trade, automotive, e-commerce, healthcare and more. We have ambitious targets for growth in the coming years and are therefore expanding our international team, especially in the commercial area.</span></div><div><br></div><div><span style=\"font-size: 12pt\">We currently have a team of 200 people from 29 nations in our engineering hubs in Hamburg and Lisbon. For both hubs, we are looking for ambitious and well-qualified business experts with an excellent university degree. Read below to find out what our expectations are, and what you can expect from us.</span></div><div><br></div><div><span style=\"font-size: 12pt\">We look forward to receiving your application!</span></div>","id":"d9293b06-5ca9-4038-a0a0-0806a79171af","lists":[{"text":"ABOUT YOUR JOB","content":"<li>You are responsible for the commercial success of international software projects, working with a highly qualified management team led by our founders.</li><li>You maintain and expand successful relationships with our clients with a clear vision of the future.</li><li>You actively build up new successful relationships with prospects and leads and turn them into clients. You shape the start of new projects together with our engineering organization.</li><li>You understand our clients’ business goals and the derived product strategy to support our software engineers in implementing them. In doing so, you lead several accounts in a highly agile environment and ensure effective, reliable and data-driven product development.</li><li>You are a trustful partner for our clients on C-level and actively remove all of your teams’ impediments that need to be solved on management level.</li><li>Throughout your work, you advance and monitor our business and growth targets through long-term project planning.</li>"},{"text":"ABOUT YOU","content":"<li>You are an entrepreneur at heart and make the economic success of your projects as well as the success and satisfaction of your clients your top priority.</li><li>You have a first-class university degree in the field of economics and can prove your first years of professional experience in successfully managing and extending client relationships – preferably in a start-up.</li><li>You are able to handle several accounts and set priorities.</li><li>You are enthusiastic about digital technology.</li><li>You think and act like an entrepreneur: You are independent, driven by numbers and data and solution-oriented.</li><li>You are confident in dealing with numbers and have an analytical mindset.&nbsp;</li><li>You are fluent in German and English.</li><li>Your outstanding communication skills and your intuition for our clients’ needs enable you to confidently and convincingly work with top management on the client side.</li><li>You are committed to improving yourself and learning something new every day. You enjoy thinking ahead and contributing to the decision-making process. You accept challenges without losing sight of possible risks.&nbsp;</li><li>You are honest and have a sense of humor. You are captivating, charming and assertive. You don't want just any job, you want to make a difference with your ideas and your skills.</li>"}],"text":"Business Director (m/f/d)","country":"DE","workplaceType":"hybrid","hostedUrl":"https://jobs.lever.co/freiheit-2/d9293b06-5ca9-4038-a0a0-0806a79171af","applyUrl":"https://jobs.lever.co/freiheit-2/d9293b06-5ca9-4038-a0a0-0806a79171af/apply"},{"additional":"","additionalPlain":"","categories":{"commitment":"Full-time","location":"Hamburg","team":"People, Commercial and Organization"},"createdAt":1687939587395,"descriptionPlain":"ÜBER UNSERE COMPANY\n\nfreiheit.com ist seit 1999 Premiumanbieter digitaler Softwareprodukte für namhafte internationale Kunden. Unsere Produkte werden von Millionen von Usern mit tausenden von Anfragen pro Sekunde genutzt. Seit über 24 Jahren arbeiten wir für das „Who's Who“ der deutschen und europäischen Industrie und Wirtschaft – quer über alle Branchen. Handel, Automotive, E-Commerce, Healthcare etc.\n\nAlle Produkte haben für unsere Kunden eine sehr hohe strategische Relevanz und sind daher maßgeblich für ihren wirtschaftlichen Erfolg. Failure is not an option. Wir sind bekannt für unsere hohe Reputation am Markt und als Arbeitgeber sehr geschätzt aufgrund des starken Zusammenhalts unserer einzigartigen Community.\n\nFür die nächsten Jahre haben wir ambitionierte Wachstumsziele und bauen deshalb unser internationales Team aus.\n","description":"<div><b style=\"font-size: 11pt\">ÜBER UNSERE COMPANY</b></div><div><br></div><div><span style=\"font-size: 12pt\">freiheit.com ist seit 1999 Premiumanbieter digitaler Softwareprodukte für namhafte internationale Kunden. Unsere Produkte werden von Millionen von Usern mit tausenden von Anfragen pro Sekunde genutzt. Seit über 24 Jahren arbeiten wir für das „Who's Who“ der deutschen und europäischen Industrie und Wirtschaft – quer über alle Branchen. Handel, Automotive, E-Commerce, Healthcare etc.</span></div><div><br></div><div><span style=\"font-size: 12pt\">Alle Produkte haben für unsere Kunden eine sehr hohe strategische Relevanz und sind daher maßgeblich für ihren wirtschaftlichen Erfolg. Failure is not an option. Wir sind bekannt für unsere hohe Reputation am Markt und als Arbeitgeber sehr geschätzt aufgrund des starken Zusammenhalts unserer einzigartigen Community.</span></div><div><br></div><div><span style=\"font-size: 12pt\">Für die nächsten Jahre haben wir ambitionierte Wachstumsziele und bauen deshalb unser internationales Team aus.</span></div>","id":"eeaceee0-e273-4078-a226-2215b7f6542b","lists":[{"text":"ÜBER DEINEN JOB","content":"<li>Du bist verantwortlich für alle unsere Texte – auf Social Media, unseren Recruiting-Kanälen und unserer Website – und dafür, dass alles stets up-to-date ist.</li><li>Du entwickelst und realisierst interne und externe Formate mit Blick auf unsere Kommunikationsstrategie und -ziele in Hamburg und Lissabon.</li><li>Du bist mitten im Geschehen bei allen Ereignissen in unserer Company, entwickelst eigenständig Ideen für neuen Content und veröffentlichst diesen auf unserer Website, unserem YouTube-Channel und weiteren gängigen Social-Media-Plattformen wie beispielsweise LinkedIn.Für unsere nachhaltige Bekanntheit und hohe Reputation am Markt begleitest Du die Erstellung mehrseitiger PR-Studien zu unseren Projekten in Zusammenarbeit mit unseren internen Experten und externen Autoren und Marktforschungsunternehmen.</li><li>Du recherchierst vielfältige Themen und tauchst darin tief ein, um die für unsere Zielgruppe relevantesten Inhalte verständlich auf den Punkt zu bringen.</li><li>Du bist in der digitalen Welt zu Hause und kennst Dich mit kreativen Kampagnen und Social-Media-Kanälen aus. Du kennst Deine Target Group, um Online-Kampagnen auch kommerziell erfolgreich umzusetzen und behältst dabei Dein Budget immer im Blick.</li><li>Du willst Dich und Deine Prozesse ständig verbessern. Neben der kreativen Arbeit misst Du kontinuierlich den Erfolg Deiner Beiträge entlang von Kennzahlen. Mit Dashboards und Reportings machst Du dies für unsere Geschäftsführung transparent.</li>"},{"text":"ÜBER DICH","content":"<li>Du hast ein erfolgreich abgeschlossenes Hochschulstudium der Kommunikations- und Geisteswissenschaften, Wirtschaftswissenschaften, des Journalismus oder eines vergleichbaren Studiengangs.</li><li>Du kannst eine (mehrteilige) Geschichte erzählen, bist sicher im Formulieren von Texten in deutscher sowie in englischer Sprache und findest immer den richtigen Ton – sei es bei einem LinkedIn-Posting oder einem Interview in der Fachpresse.</li><li>Du hast bereits mehrere Jahre im Bereich Social Media oder Unternehmenskommunikation gearbeitet – vorzugsweise “inhouse” bei einem Unternehmen aus der Software-Industrie.</li><li>Du hast Erfahrung im Bereich Texterstellung, gern mit Fokus auf Social Media. Du kennst die großen Plattformen (insbesondere LinkedIn und YouTube) und hast dort bereits Kampagnen erfolgreich geplant, umgesetzt und ausgewertet. Performance Marketing sowie die Kennzahlenanalyse von z. B. CTR oder ROI gehören bei Dir zum Handwerkszeug.</li><li>Du bist neuen Themen gegenüber aufgeschlossen, besitzt hohe Überzeugungskraft, bist belastbar und verfügst über einen ausgeprägten Ehrgeiz. Du bist ehrlich, empathisch und hast Humor. Du bist mitreißend, charmant und durchsetzungsstark.&nbsp;Du willst nicht irgendeinen Job, sondern Du willst als aktives Mitglied in einem starken Team eigenverantwortlich handeln und etwas bewegen!</li>"}],"salaryDescription":"<div><br></div><div><b style=\"font-size: 11pt\">ÜBER UNSERE COMMUNITY</b></div><div><br></div><div><span style=\"font-size: 11pt\">In unseren Engineering Hubs in Hamburg und Lissabon triffst Du auf Menschen aus aller Welt, verschiedene Kulturen, Farben, Sprachen, Geschlechter und Lebensstile. Wir lieben Vielfalt und Offenheit.</span></div><div><br></div><div><span style=\"font-size: 11pt\">Wenn man irgendjemanden fragt, warum er hier arbeitet, ist es ziemlich wahrscheinlich, dass die Leute sagen werden \"wegen der Menschen\" und \"weil ich in meinem Leben noch nie so viel gelernt habe\". Unser Unternehmen ist ein Ort, an dem man man selbst sein kann, sich hohe Ziele setzt, sich umeinander kümmert und grenzenlos wachsen kann.</span></div><div><br></div><div><span style=\"font-size: 11pt\">In unseren zentral gelegenen Büros trifft sich unsere Community nicht nur, um zu arbeiten, sondern auch zum Billardspielen und zum Spaßhaben mit den Teammitgliedern.&nbsp;Viel wichtiger aber ist, dass wir Dir die Möglichkeit geben, mit intelligenten Menschen an interessanten Aufgaben zu arbeiten und ein komplettes Projekt von der Idee bis zur Umsetzung eigenverantwortlich zu realisieren.</span></div><div><br></div><div><b style=\"font-size: 11pt\">DAZUGEHÖREN?</b></div><div><br></div><div><span style=\"font-size: 11pt\">Dann schicke uns Deine vollständigen Bewerbungsunterlagen (Lebenslauf und Zeugnisse) über unser Bewerberportal. Und bei Fragen zu Deiner Bewerbung oder dem Bewerbungsprozess steht Dir Lena Oechtering unter +49 40/890584-0 persönlich zur Verfügung.</span></div><div><br></div>","salaryDescriptionPlain":"\nÜBER UNSERE COMMUNITY\n\nIn unseren Engineering Hubs in Hamburg und Lissabon triffst Du auf Menschen aus aller Welt, verschiedene Kulturen, Farben, Sprachen, Geschlechter und Lebensstile. Wir lieben Vielfalt und Offenheit.\n\nWenn man irgendjemanden fragt, warum er hier arbeitet, ist es ziemlich wahrscheinlich, dass die Leute sagen werden &quot;wegen der Menschen&quot; und &quot;weil ich in meinem Leben noch nie so viel gelernt habe&quot;. Unser Unternehmen ist ein Ort, an dem man man selbst sein kann, sich hohe Ziele setzt, sich umeinander kümmert und grenzenlos wachsen kann.\n\nIn unseren zentral gelegenen Büros trifft sich unsere Community nicht nur, um zu arbeiten, sondern auch zum Billardspielen und zum Spaßhaben mit den Teammitgliedern. Viel wichtiger aber ist, dass wir Dir die Möglichkeit geben, mit intelligenten Menschen an interessanten Aufgaben zu arbeiten und ein komplettes Projekt von der Idee bis zur Umsetzung eigenverantwortlich zu realisieren.\n\nDAZUGEHÖREN?\n\nDann schicke uns Deine vollständigen Bewerbungsunterlagen (Lebenslauf und Zeugnisse) über unser Bewerberportal. Und bei Fragen zu Deiner Bewerbung oder dem Bewerbungsprozess steht Dir Lena Oechtering unter +49 40/890584-0 persönlich zur Verfügung.\n\n","text":"Communication Manager (m/w/d)","country":"DE","workplaceType":"hybrid","hostedUrl":"https://jobs.lever.co/freiheit-2/eeaceee0-e273-4078-a226-2215b7f6542b","applyUrl":"https://jobs.lever.co/freiheit-2/eeaceee0-e273-4078-a226-2215b7f6542b/apply"},{"additionalPlain":"ABOUT OUR COMMUNITY\n\nIn our Engineering Hubs in Hamburg and Lisbon you will meet people from all over the world, different cultures, colors, languages, genders and lifestyles. We celebrate diversity and openness. \n\nWhen you ask anybody why they are working here, it is pretty likely that people will say “because of the people” and “because I have never learnt so much in my life”. Our company is a place to be yourself, aim high, taking care of each other and growing without limits.\n\nOf course we have a beautiful office in a very nice area of each city, a place to hang-out and play pool and have fun with your team members. But more important is that we offer you the ability to work on interesting things and owning a complete large-scale project from idea to implementation and operations. You have the opportunity to learn from senior engineers, work in a well-organized and well-managed company and start a fulfilling career in tech.\n\nP.S.: Although we visit our customers regularly, all team members are working mainly from Hamburg or Lisbon and not on the customers’ premises.\n\nDO YOU WANT TO BE PART OF OUR TEAM?\n\nThen send us your complete application documents (curriculum vitae and references) via email or our application portal. And if you have any questions about your application or the application process, Lena Oechtering is available on +49 40/890584-0.\n\n \nPrivacy policy\n","additional":"<div><span style=\"font-size: 24px\">ABOUT OUR COMMUNITY</span></div><div><br></div><div>In our Engineering Hubs in Hamburg and Lisbon you will meet people from all over the world, different cultures, colors, languages, genders and lifestyles. We celebrate diversity and openness.&nbsp;</div><div><br></div><div>When you ask anybody why they are working here, it is pretty likely that people will say “because of the people” and “because I have never learnt so much in my life”. Our company is a place to be yourself, aim high, taking care of each other and growing without limits.</div><div><br></div><div>Of course we have a beautiful office in a very nice area of each city, a place to hang-out and play pool and have fun with your team members. But more important is that we offer you the ability to work on interesting things and owning a complete large-scale project from idea to implementation and operations. You have the opportunity to learn from senior engineers, work in a well-organized and well-managed company and start a fulfilling career in tech.</div><div><br></div><div>P.S.: Although we visit our customers regularly, all team members are working mainly from Hamburg or Lisbon and not on the customers’ premises.</div><div><br></div><div><span style=\"font-size: 24px\">DO YOU WANT TO BE PART OF OUR TEAM?</span></div><div><br></div><div>Then send us your complete application documents (curriculum vitae and references) via email or our application portal. And if you have any questions about your application or the application process, Lena Oechtering is available on +49 40/890584-0.</div><div><br></div><div>&nbsp;</div><div><a href=\"https://freiheit.com/privacy_policy/#lever\" class=\"postings-link\">Privacy policy</a></div>","categories":{"commitment":"Full-time","location":"Hamburg","team":"Engineers"},"createdAt":1596468378145,"descriptionPlain":"ABOUT OUR COMPANY\n\nfreiheit.com’s software engineers have been building large-scale software systems since 1999. We are internet pioneers and we have delivered hundreds of projects for our customers that are used by millions of users with thousands of requests per second since then.\n\nIn the last two decades we have been constantly reinventing and improving ourselves. Self-Improvement and learning are deeply ingrained into our company's DNA and in the personality of all of our team members. We tackle new and interesting problems all the time and very often create things that nobody has built before.\n\nAt heart we are an unusual, innovative and bold engineering company. 85 % of our people are engineers with backgrounds in Computer Science, Physics or Mathematics, many also with strong machine learning backgrounds.\n\nWe hire the top ranking students directly from university or from their first work experience and actively develop them to become well-rounded software engineers.\n\nFrom our Engineering Hubs in Hamburg and Lisbon we work for large and mid-sized companies to reinvent their future with technology. \n","description":"<div><span style=\"font-size: 24px\">ABOUT OUR COMPANY</span></div><div><br></div><div><a href=\"http://freiheit.com\" class=\"postings-link\">freiheit.com</a>’s software engineers have been building large-scale software systems since 1999. We are internet pioneers and we have delivered hundreds of projects for our customers that are used by millions of users with thousands of requests per second since then.</div><div><br></div><div>In the last two decades we have been constantly reinventing and improving ourselves. Self-Improvement and learning are deeply ingrained into our company's DNA and in the personality of all of our team members. We tackle new and interesting problems all the time and very often create things that nobody has built before.</div><div><br></div><div>At heart we are an unusual, innovative and bold engineering company. 85 % of our people are engineers with backgrounds in Computer Science, Physics or Mathematics, many also with strong machine learning backgrounds.</div><div><br></div><div>We hire the top ranking students directly from university or from their first work experience and actively develop them to become well-rounded software engineers.</div><div><br></div><div>From our Engineering Hubs in Hamburg and Lisbon we work for large and mid-sized companies to reinvent their future with technology.&nbsp;</div>","id":"6834fcad-28d3-4819-a7c3-c8f13669d04f","lists":[{"text":"ABOUT YOUR JOB","content":"<li>As a Site Reliability Engineer you apply software engineering principles to run large-scale systems.</li><li>You are responsible for the reliability and performance of large-scale, distributed systems running in the cloud. You set up the test and production environments together with our engineering teams using infrastructure as code. You automate manual tasks and monitor your clusters on your own responsibility.</li><li>You are able to do administrative tasks, but you automate any repeating tasks.</li><li>You’re interested in automation, keeping things simple, and supporting engineering teams to continuously ship great software.</li><li>The job profile is new and a great opportunity for system administrators or software engineers interested in running large cloud systems.</li><li>This job requires software engineering, programming and systems administration skills.</li><li>We have a flexible Hybrid Work model where most people work 2-3 days per week from home.</li>"},{"text":"ABOUT YOU","content":"<li>Bachelor’s degree in Computer Science or related fields like Mathematics, Physics or Electrical Engineering</li><li>Experience with Docker and Kubernetes</li><li>Experience in UNIX systems administration</li><li>Programming experience – ideally in Go</li><div><br></div><div>Bonus skills and interests:&nbsp;</div><div><br></div><li>Master or PhD in Computer Science or related fields like Mathematics or Physics</li><li>Experience in Google Cloud Platform (GCP), Amazon Web Services (AWS) or Microsoft Azure</li><li>Experience with observability (logging, monitoring, alerting, tracing)</li><li>Experience with networking</li><li>Experience with security</li><li>Experience working with distributed systems in the Cloud (Terraform)</li><li>Experience in setting up CI/CD pipelines</li>"}],"text":"Hackers wanted - Site Reliability Engineer (m/f/d)","country":"DE","workplaceType":"hybrid","hostedUrl":"https://jobs.lever.co/freiheit-2/6834fcad-28d3-4819-a7c3-c8f13669d04f","applyUrl":"https://jobs.lever.co/freiheit-2/6834fcad-28d3-4819-a7c3-c8f13669d04f/apply"},{"additionalPlain":"ABOUT OUR COMMUNITY\n\nIn our Engineering Hubs in Hamburg and Lisbon you will meet people from all over the world, different cultures, colors, languages, genders and lifestyles. We celebrate diversity and openness. \n\nWhen you ask anybody why they are working here, it is pretty likely that people will say “because of the people” and “because I have never learnt so much in my life”. Our company is a place to be yourself, aim high, taking care of each other and growing without limits.\n\nOf course we have a beautiful office in a very nice area of each city, a place to hang-out and play pool and have fun with your team members. But more important is that we offer you the ability to work on interesting things and owning a complete large-scale project from idea to implementation and operations. You have the opportunity to learn from senior engineers, work in a well-organized and well-managed company and start a fulfilling career in tech.\n\nP.S.: Although we visit our customers regularly, all team members are working mainly from Hamburg or Lisbon and not on the customers’ premises.\n\n\nDO YOU WANT TO BE PART OF OUR TEAM?\n\nThen send us your complete application documents (curriculum vitae and references) via email or our application portal. And if you have any questions about your application or the application process, Lena Oechtering is available to you personally on +49 40/890584-0.\n\nPrivacy policy\n","additional":"<div><span style=\"font-size: 24px\">ABOUT OUR COMMUNITY</span></div><div><br></div><div>In our Engineering Hubs in Hamburg and Lisbon you will meet people from all over the world, different cultures, colors, languages, genders and lifestyles. We celebrate diversity and openness.&nbsp;</div><div><br></div><div>When you ask anybody why they are working here, it is pretty likely that people will say “because of the people” and “because I have never learnt so much in my life”. Our company is a place to be yourself, aim high, taking care of each other and growing without limits.</div><div><br></div><div>Of course we have a beautiful office in a very nice area of each city, a place to hang-out and play pool and have fun with your team members. But more important is that we offer you the ability to work on interesting things and owning a complete large-scale project from idea to implementation and operations. You have the opportunity to learn from senior engineers, work in a well-organized and well-managed company and start a fulfilling career in tech.</div><div><br></div><div>P.S.: Although we visit our customers regularly, all team members are working mainly from Hamburg or Lisbon and not on the customers’ premises.</div><div><br></div><div><br></div><div><span style=\"font-size: 24px\">DO YOU WANT TO BE PART OF OUR TEAM?</span></div><div><br></div><div>Then send us your complete application documents (curriculum vitae and references) via email or our application portal. And if you have any questions about your application or the application process, Lena Oechtering is available to you personally on +49 40/890584-0.</div><div><br></div><div><a href=\"https://freiheit.com/privacy_policy/#lever\" class=\"postings-link\">Privacy policy</a></div>","categories":{"commitment":"Full-time","location":"Hamburg","team":"Engineers"},"createdAt":1592234607918,"descriptionPlain":"ABOUT OUR COMPANY\n\nfreiheit.com’s software engineers have been building large-scale software systems since 1999. We are internet pioneers and we have delivered hundreds of projects for our customers that are used by millions of users with thousands of requests per second since then. \n\nIn the last two decades we have been constantly reinventing and improving ourselves. Self-Improvement and learning are deeply ingrained into our company's DNA and in the personality of all of our team members. We tackle new and interesting problems all the time and very often create things that nobody has built before. \n\nAt heart we are an unusual, innovative and bold engineering company. 85% of our people are engineers with backgrounds in Computer Science, Physics or Mathematics, many also with strong machine learning backgrounds. We hire the top ranking students directly from university or from their first work experience and actively develop them to become well-rounded software engineers. \n\nFrom our Engineering Hubs in Hamburg and Lisbon we work for large and mid-sized companies to reinvent their future with technology. \n\n\nABOUT YOUR JOB\n\n·\tYou start in one of our engineering teams. Team size is maximum five people.\n·\tYou will receive a lot of introductory training in the first weeks about the technologies you are going to use in your project. \n·\tThe trainings are conducted by software engineers from our own company.\n·\tYou are involved in every part of the software engineering process and in the lifecycle of the services that your team is building - design,   \n    development, testing, deployment, maintenance, operations and improving software based on user feedback and usage data.\n· \tYou work closely with our customers to iteratively improve their product offering by conceiving, refining and delivering new ideas.\n\n\nABOUT YOU\n\nQualifications:\n\n·\tBachelor’s degree in Computer Science or related fields like Mathematics or Physics\n·\tExperience in C/C++, Python or Java\n·\tAbility to learn fast \n·\tAlgorithms and data structures, understanding time & space complexity\n·\t5+ years of experience as a software engineer (writing code every day)\n·\tWorked in teams of at least five members\n·\tDelivered 2-3 projects from first line of code to production launch\n·\tStayed on at least 1-2 years in each team/project\n·\tHigh influence on the technical success of their past projects\n\nBonus skills or interests:\n\n·\tMaster or PhD in Computer Science or related fields like Mathematics or Physics\n·\tExperience in Go, Kotlin, TypeScript or JavaScript\n·\tExperience in front end development, like ReactJS, Angular, Vue or Flutter/Dart\n·  Functional programming with Common Lisp, Clojure or Haskell\n·\tExperience working with distributed systems in the Cloud\n·\tExperience in Machine Learning and Data Science\n·\tCompetitive Programming\n","description":"<div><span style=\"font-size: 24px\">ABOUT OUR COMPANY</span></div><div><br></div><div>freiheit.com’s software engineers have been building large-scale software systems since 1999. We are internet pioneers and we have delivered hundreds of projects for our customers that are used by millions of users with thousands of requests per second since then. </div><div><br></div><div>In the last two decades we have been constantly reinventing and improving ourselves. Self-Improvement and learning are deeply ingrained into our company's DNA and in the personality of all of our team members. We tackle new and interesting problems all the time and very often create things that nobody has built before. </div><div><br></div><div>At heart we are an unusual, innovative and bold engineering company. 85% of our people are engineers with backgrounds in Computer Science, Physics or Mathematics, many also with strong machine learning backgrounds. We hire the top ranking students directly from university or from their first work experience and actively develop them to become well-rounded software engineers. </div><div><br></div><div>From our Engineering Hubs in Hamburg and Lisbon we work for large and mid-sized companies to reinvent their future with technology. </div><div><br></div><div><br></div><div><span style=\"font-size: 24px\">ABOUT YOUR JOB</span></div><div><br></div><div><b style=\"font-size: 14pt\">·</b>\tYou start in one of our engineering teams. Team size is maximum five people.</div><div><b style=\"font-size: 14pt\">·</b>\tYou will receive a lot of introductory training in the first weeks about the technologies you are going to use in your project. </div><div><b style=\"font-size: 14pt\">·</b>\tThe trainings are conducted by software engineers from our own company.</div><div><b style=\"font-size: 14pt\">·</b>\tYou are involved in every part of the software engineering process and in the lifecycle of the services that your team is building - design,   </div><div>    development, testing, deployment, maintenance, operations and improving software based on user feedback and usage data.</div><div><b style=\"font-size: 14pt\">· </b>\tYou work closely with our customers to iteratively improve their product offering by conceiving, refining and delivering new ideas.</div><div><br></div><div><br></div><div><span style=\"font-size: 24px\">ABOUT YOU</span></div><div><br></div><div>Qualifications:</div><div><br></div><div><b style=\"font-size: 14pt\">·</b>\tBachelor’s degree in Computer Science or related fields like Mathematics or Physics</div><div><b style=\"font-size: 14pt\">·</b>\tExperience in C/C++, Python or Java</div><div><b style=\"font-size: 14pt\">·</b>\tAbility to learn fast&nbsp;</div><div><b style=\"font-size: 14pt\">·</b>\tAlgorithms and data structures, understanding time &amp; space complexity</div><div><b style=\"font-size: 14pt\">·</b>\t5+ years of experience as a software engineer (writing code every day)</div><div><b style=\"font-size: 14pt\">·</b>\tWorked in teams of at least five members</div><div><b style=\"font-size: 14pt\">·</b>\tDelivered 2-3 projects from first line of code to production launch</div><div><b style=\"font-size: 14pt\">·</b>\tStayed on at least 1-2 years in each team/project</div><div><b style=\"font-size: 14pt\">·</b>\tHigh influence on the technical success of their past projects</div><div><br></div><div>Bonus skills or interests:</div><div><br></div><div><b style=\"font-size: 14pt\">·</b>\tMaster or PhD in Computer Science or related fields like Mathematics or Physics</div><div><b style=\"font-size: 14pt\">·</b>\tExperience in Go, Kotlin, TypeScript or JavaScript</div><div><b style=\"font-size: 14pt\">·</b>\tExperience in front end development, like ReactJS, Angular, Vue or Flutter/Dart</div><div><b style=\"font-size: 14pt\">·  </b>Functional programming with Common Lisp, Clojure or Haskell</div><div><b style=\"font-size: 14pt\">·</b>\tExperience working with distributed systems in the Cloud</div><div><b style=\"font-size: 14pt\">·</b>\tExperience in Machine Learning and Data Science</div><div><b style=\"font-size: 14pt\">·</b>\tCompetitive Programming</div>","id":"784b0a99-1a66-4033-8b96-266a2d142756","lists":[],"text":"Hackers wanted – Senior Software Engineer (m/f/d)","country":"DE","workplaceType":"hybrid","hostedUrl":"https://jobs.lever.co/freiheit-2/784b0a99-1a66-4033-8b96-266a2d142756","applyUrl":"https://jobs.lever.co/freiheit-2/784b0a99-1a66-4033-8b96-266a2d142756/apply"},{"additionalPlain":"ABOUT OUR COMMUNITY\n\nIn our Engineering Hubs in Hamburg and Lisbon you will meet people from all over the world, different cultures, colors, languages, genders and lifestyles. We celebrate diversity and openness. \n\nWhen you ask anybody why they are working here, it is pretty likely that people will say “because of the people” and “because I have never learnt so much in my life”. Our company is a place to be yourself, aim high, taking care of each other and growing without limits.\n\nOf course we have a beautiful office in a very nice area of each city, a place to hang-out and play pool and have fun with your team members. But more important is that we offer you the ability to work on interesting things and owning a complete large-scale project from idea to implementation and operations. You have the opportunity to learn from senior engineers, work in a well-organized and well-managed company and start a fulfilling career in tech.\n\nP.S.: Although we visit our customers regularly, all team members are working mainly from Hamburg or Lisbon and not on the customers’ premises.\n\nDO YOU WANT TO BE PART OF OUR TEAM?\n\nThen send us your complete application documents (curriculum vitae and references) via email or our application portal. And if you have any questions about your application or the application process, Lena Oechtering is available to you personally on +49 40/890584-0.\n\n \nPrivacy policy\n","additional":"<div><span style=\"font-size: 24px\">ABOUT OUR COMMUNITY</span></div><div><br></div><div>In our Engineering Hubs in Hamburg and Lisbon you will meet people from all over the world, different cultures, colors, languages, genders and lifestyles. We celebrate diversity and openness.&nbsp;</div><div><br></div><div>When you ask anybody why they are working here, it is pretty likely that people will say “because of the people” and “because I have never learnt so much in my life”. Our company is a place to be yourself, aim high, taking care of each other and growing without limits.</div><div><br></div><div>Of course we have a beautiful office in a very nice area of each city, a place to hang-out and play pool and have fun with your team members. But more important is that we offer you the ability to work on interesting things and owning a complete large-scale project from idea to implementation and operations. You have the opportunity to learn from senior engineers, work in a well-organized and well-managed company and start a fulfilling career in tech.</div><div><br></div><div>P.S.: Although we visit our customers regularly, all team members are working mainly from Hamburg or Lisbon and not on the customers’ premises.</div><div><br></div><div><span style=\"font-size: 24px\">DO YOU WANT TO BE PART OF OUR TEAM?</span></div><div><br></div><div>Then send us your complete application documents (curriculum vitae and references) via email or our application portal. And if you have any questions about your application or the application process, Lena Oechtering is available to you personally on +49 40/890584-0.</div><div><br></div><div>&nbsp;</div><div><a href=\"https://freiheit.com/en/datenschutz/#lever\" class=\"postings-link\">Privacy policy</a></div>","categories":{"commitment":"Full-time","location":"Hamburg","team":"Engineers"},"createdAt":1592234545326,"descriptionPlain":"ABOUT OUR COMPANY\n\nfreiheit.com’s software engineers have been building large-scale software systems since 1999. We are internet pioneers and we have delivered hundreds of projects for our customers that are used by millions of users with thousands of requests per second since then.\n\nIn the last two decades we have been constantly reinventing and improving ourselves. Self-Improvement and learning are deeply ingrained into our company's DNA and in the personality of all of our team members. We tackle new and interesting problems all the time and very often create things that nobody has built before.\n\nAt heart we are an unusual, innovative and bold engineering company. 85% of our people are engineers with backgrounds in Computer Science, Physics or Mathematics, many also with strong machine learning backgrounds.\n\nWe hire the top ranking students directly from university or from their first work experience and actively develop them to become well-rounded software engineers.\n\nFrom our Engineering Hubs in Hamburg and Lisbon we work for large and mid-sized companies to reinvent their future with technology. \n\n\nABOUT YOUR JOB\n\n·\tYou start in one of our engineering teams. Team size is maximum five people.\n·\tYou will receive a lot of introductory training in the first weeks about the technologies you are going to use in your project.                               The trainings are conducted by software engineers from our own company.\n·\tYou are involved in every part of the software engineering process and in the lifecycle of the services that your team is building -                design, development, testing, deployment, maintenance, operations and improving software based on user feedback and usage data.\n·\tYou work closely with our customers to iteratively improve their product offering by conceiving, refining and delivering new ideas.\n\n\nABOUT YOU\n\nQualifications:\n\n·\tBachelor’s degree in Computer Science or related fields like Mathematics or Physics\n·\tExperience in C/C++, Python or Java\n·\tAbility to learn fast \n\nBonus skills or interests:\n\n·\tMaster or PhD in Computer Science or related fields like Mathematics or Physics\n·\tAlgorithms and data structures, understanding time & space complexity\n·\tExperience in Go, Kotlin, TypeScript or JavaScript\n·\tExperience in front end development, like ReactJS, Angular, Vue or Flutter/Dart\n·\tFunctional programming with Common Lisp, Clojure or Haskell\n·\tExperience working with distributed systems in the Cloud\n·\tExperience in Machine Learning and Data Science\n·\tCompetitive Programming\n","description":"<div><span style=\"font-size: 24px\">ABOUT OUR COMPANY</span></div><div><br></div><div>freiheit.com’s software engineers have been building large-scale software systems since 1999. We are internet pioneers and we have delivered hundreds of projects for our customers that are used by millions of users with thousands of requests per second since then.</div><div><br></div><div>In the last two decades we have been constantly reinventing and improving ourselves. Self-Improvement and learning are deeply ingrained into our company's DNA and in the personality of all of our team members. We tackle new and interesting problems all the time and very often create things that nobody has built before.</div><div><br></div><div>At heart we are an unusual, innovative and bold engineering company. 85% of our people are engineers with backgrounds in Computer Science, Physics or Mathematics, many also with strong machine learning backgrounds.</div><div><br></div><div>We hire the top ranking students directly from university or from their first work experience and actively develop them to become well-rounded software engineers.</div><div><br></div><div>From our Engineering Hubs in Hamburg and Lisbon we work for large and mid-sized companies to reinvent their future with technology.&nbsp;</div><div><br></div><div><br></div><div><span style=\"font-size: 24px\">ABOUT YOUR JOB</span></div><div><br></div><div><b style=\"font-size: 14pt\">·</b>\tYou start in one of our engineering teams. Team size is maximum five people.</div><div><b style=\"font-size: 14pt\">·</b>\tYou will receive a lot of introductory training in the first weeks about the technologies you are going to use in your project.                               The trainings are conducted by software engineers from our own company.</div><div><b style=\"font-size: 14pt\">·</b>\tYou are involved in every part of the software engineering process and in the lifecycle of the services that your team is building -                design, development, testing, deployment, maintenance, operations and improving software based on user feedback and usage data.</div><div><b style=\"font-size: 14pt\">·</b>\tYou work closely with our customers to iteratively improve their product offering by conceiving, refining and delivering new ideas.</div><div><br></div><div><br></div><div><span style=\"font-size: 24px\">ABOUT YOU</span></div><div><br></div><div>Qualifications:</div><div><br></div><div><b style=\"font-size: 14pt\">·</b>\tBachelor’s degree in Computer Science or related fields like Mathematics or Physics</div><div><b style=\"font-size: 14pt\">·</b>\tExperience in C/C++, Python or Java</div><div><b style=\"font-size: 14pt\">·</b>\tAbility to learn fast&nbsp;</div><div><br></div><div>Bonus skills or interests:</div><div><br></div><div><b style=\"font-size: 14pt\">·</b>\tMaster or PhD in Computer Science or related fields like Mathematics or Physics</div><div><b style=\"font-size: 14pt\">·</b>\tAlgorithms and data structures, understanding time &amp; space complexity</div><div><b style=\"font-size: 14pt\">·</b>\tExperience in Go, Kotlin, TypeScript or JavaScript</div><div><b style=\"font-size: 14pt\">·</b>\tExperience in front end development, like ReactJS, Angular, Vue or Flutter/Dart</div><div><b style=\"font-size: 14pt\">·</b>\tFunctional programming with Common Lisp, Clojure or Haskell</div><div><b style=\"font-size: 14pt\">·</b>\tExperience working with distributed systems in the Cloud</div><div><b style=\"font-size: 14pt\">·</b>\tExperience in Machine Learning and Data Science</div><div><b style=\"font-size: 14pt\">·</b>\tCompetitive Programming</div>","id":"2e9dc2ab-ce52-4089-bc5f-bb714ea92a42","lists":[],"text":"Hackers wanted – Software Engineers (m/f/d)!","country":"DE","workplaceType":"hybrid","hostedUrl":"https://jobs.lever.co/freiheit-2/2e9dc2ab-ce52-4089-bc5f-bb714ea92a42","applyUrl":"https://jobs.lever.co/freiheit-2/2e9dc2ab-ce52-4089-bc5f-bb714ea92a42/apply"},{"additionalPlain":"ÜBER UNSERE COMMUNITY\n\nIn unseren Engineering Hubs in Lissabon und Hamburg triffst Du auf Menschen aus aller Welt, verschiedene Kulturen, Farben, Sprachen, Geschlechter und Lebensstile. Wir lieben die Vielfalt und Offenheit.\n\nWenn man irgendjemanden fragt, warum er hier arbeitet, ist es ziemlich wahrscheinlich, dass die Leute sagen werden \"wegen der Menschen\" und \"weil ich in meinem Leben noch nie so viel gelernt habe\". Unser Unternehmen ist ein Ort, an dem man man selbst sein kann, sich hohe Ziele setzt, sich umeinander kümmert und grenzenlos wachsen kann.\n\nUnsere Büros sind im Herzen Hamburgs und Lissabons und bieten viele Möglichkeiten sich auch neben dem Arbeiten zu treffen: Billard spielen, gemeinsam Musik machen,  Board Game Nights oder einfach nur Zeit nach dem Feierabend miteinander verbringen, Freundschaften schließen und den schönen Ausblick genießen. Und last but not least geht es darum, mit intelligenten Menschen an interessanten Aufgaben zu arbeiten und ein komplettes Projekt von der Idee bis zur Umsetzung eigenverantwortlich zu realisieren.\n\nDAZUGEHÖREN?\n\nDann schick uns Deine vollständigen Bewerbungsunterlagen (Anschreiben, Lebenslauf und Zeugnisse) über unser Bewerberportal. Bei Fragen zu Deiner Bewerbung oder dem Bewerbungsprozess steht Dir Lena Oechtering unter  \n+49 40/890584-0 persönlich zur Verfügung.\n","additional":"<div><b style=\"font-size: 11pt\">ÜBER UNSERE COMMUNITY</b></div><div><br></div><div><span style=\"font-size: 11pt\">In unseren Engineering Hubs in Lissabon und Hamburg triffst Du auf Menschen aus aller Welt, verschiedene Kulturen, Farben, Sprachen, Geschlechter und Lebensstile. Wir lieben die Vielfalt und Offenheit.</span></div><div><br></div><div><span style=\"font-size: 11pt\">Wenn man irgendjemanden fragt, warum er hier arbeitet, ist es ziemlich wahrscheinlich, dass die Leute sagen werden \"wegen der Menschen\" und \"weil ich in meinem Leben noch nie so viel gelernt habe\". Unser Unternehmen ist ein Ort, an dem man man selbst sein kann, sich hohe Ziele setzt, sich umeinander kümmert und grenzenlos wachsen kann.</span></div><div><br></div><div><span style=\"font-size: 11pt\">Unsere Büros sind im Herzen Hamburgs und Lissabons und bieten viele Möglichkeiten sich auch neben dem Arbeiten zu treffen: Billard spielen, gemeinsam Musik machen,&nbsp; Board Game Nights oder einfach nur Zeit nach dem Feierabend miteinander verbringen, Freundschaften schließen und den schönen Ausblick genießen. Und last but not least geht es darum, mit intelligenten Menschen an interessanten Aufgaben zu arbeiten und ein komplettes Projekt von der Idee bis zur Umsetzung eigenverantwortlich zu realisieren.</span></div><div><br></div><div><b style=\"font-size: 11pt\">DAZUGEHÖREN?</b></div><div><br></div><div><span style=\"font-size: 11pt\">Dann schick uns Deine vollständigen Bewerbungsunterlagen (Anschreiben, Lebenslauf und Zeugnisse) über unser Bewerberportal. Bei Fragen zu Deiner Bewerbung oder dem Bewerbungsprozess steht Dir Lena Oechtering unter  </span></div><div><span style=\"font-size: 11pt\">+49 40/890584-0 persönlich zur Verfügung.</span></div>","categories":{"commitment":"Full-time","location":"Hamburg","team":"People, Commercial and Organization"},"createdAt":1683731757885,"descriptionPlain":"ÜBER UNS\n\nfreiheit.com ist seit 1999 Premiumanbieter digitaler Softwareprodukte für namhafte internationale Kunden. Unsere Produkte werden von Millionen von Usern mit tausenden von Anfragen pro Sekunde genutzt. Seit über 24 Jahren arbeiten wir für das „Who's Who“ der deutschen und europäischen Industrie und Wirtschaft – quer über alle Branchen. Handel, Automotive, E-Commerce, Healthcare etc.\n\nAktuell sind wir ein Team von 200 Menschen aus 29 Nationen in unseren Engineering Hubs in Hamburg und Lissabon. Wir sind bekannt für unsere hohe Reputation am Markt und als Arbeitgeber sehr geschätzt wegen dem starken Zusammenhalt unserer einzigartigen Community. \n\nAls Herzstück unserer Community sorgt sich das Community Support Team um das Wohl unserer Kollegen, Kunden und Dienstleister – und sucht Dich als tatkräftige Unterstützung! \n","description":"<div><b style=\"font-size: 11pt\">ÜBER UNS</b></div><div><br></div><div><span style=\"font-size: 12pt\">freiheit.com ist seit 1999 Premiumanbieter digitaler Softwareprodukte für namhafte internationale Kunden. Unsere Produkte werden von Millionen von Usern mit tausenden von Anfragen pro Sekunde genutzt. Seit über 24 Jahren arbeiten wir für das „Who's Who“ der deutschen und europäischen Industrie und Wirtschaft – quer über alle Branchen. Handel, Automotive, E-Commerce, Healthcare etc.</span></div><div><br></div><div><span style=\"font-size: 12pt\">Aktuell sind wir ein Team von 200 Menschen aus 29 Nationen in unseren Engineering Hubs in Hamburg und Lissabon. Wir sind bekannt für unsere hohe Reputation am Markt und als Arbeitgeber sehr geschätzt wegen dem starken Zusammenhalt unserer einzigartigen Community.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 12pt\">Als Herzstück unserer Community sorgt sich das Community Support Team um das Wohl unserer Kollegen, Kunden und Dienstleister – und sucht Dich als tatkräftige Unterstützung!&nbsp;</span></div>","id":"feead104-44b7-4246-9953-2e0aac1ad134","lists":[{"text":"ÜBER DEINEN JOB:","content":"<li>Als erste(r) Ansprechpartner/-in für Deine Kollegen ergreifst Du die Initiative, sie in allen organisatorischen Belangen bestmöglich zu unterstützen. Dabei hilft Dir Deine positive Ausstrahlung sowie Deine offene, zuvorkommende und strukturiert denkende Persönlichkeit.</li><li>Du bist die Visitenkarte und somit auch Kulturbotschafter/in unserer Company. Du fühlst Dich verantwortlich dafür, dass unsere Kunden, Partner und Bewerber sich wohl fühlen und uns als warmherzigen Gastgeber in Erinnerung behalten. Aus diesem Grund ist es natürlich wichtig, dass Du und Dein Team dafür auch immer vor Ort seid.</li><li>Du organisierst Reisen von der ersten Anfrage bis zur Heimreise und sorgst dafür, dass unsere Kollegen unterwegs immer gut informiert sind. Dazu gehören Reisen zwischen unseren Engineering Hubs in Hamburg und Lissabon, Reisen zu Kundenterminen und die entsprechenden Hotel- und Restaurantreservierungen.&nbsp;</li><li>Du hast ein Auge für Details: Du steuerst die Dienstleister für das Office, achtest darauf, dass die Ausstattung unserer Räumlichkeiten mit Liebe zum Detail und Stil frisch gehalten wird und funktioniert.</li><li>Events hands-on mitzuorganisieren ist Dein Ding und Du siehst das große Ganze dabei. Das können BBQs mit unseren Kunden sein, Meetups oder auch größere Events wie Weihnachtsfeiern oder Summer Parties.</li><li>Das Office Management liegt in Deinen Händen. Du behältst den Überblick über Office-Bestände und hast immer Deine Budgets im Blick. </li><li>Zahlen sind Dir nicht fremd und Du bist die Schnittstelle zu unserem Accounting Team und unterstützt dieses bei der vorbereitenden Buchhaltung.</li>"},{"text":"ÜBER DICH:","content":"<li>Du bringst eine abgeschlossene kaufmännische Ausbildung und erste Jahre Berufserfahrung im Office-/Eventmanagement und/oder der Hotellerie mit.</li><li>Excel, Word, PowerPoint gehören zu Deiner täglichen Routine. Du fühlst Dich sicher in der Anwendung von Listen und Tabellen in Google Drive. </li><li>Du hilfst Strukturen und Prozesse einzuhalten und erkennst auch neue Wege, um im Team besser zu werden. Dir übertragene Aufgaben übernimmst Du eigenständig und löst Herausforderungen. Dabei bewahrst Du auch in turbulenten Situationen einen kühlen Kopf und trägst Dein Herz am rechten Fleck.</li><li>Als aufgeschlossene, kontaktfreudige und positive Person verfügst Du über ausgezeichnete mündliche und schriftliche Kommunikationsfähigkeiten auf Deutsch und Englisch.</li>"}],"text":"Office Manager (m/w/d)","country":"DE","workplaceType":"onsite","hostedUrl":"https://jobs.lever.co/freiheit-2/feead104-44b7-4246-9953-2e0aac1ad134","applyUrl":"https://jobs.lever.co/freiheit-2/feead104-44b7-4246-9953-2e0aac1ad134/apply"},{"additionalPlain":"ÜBER UNSERE COMMUNITY\n\nIn unseren Engineering Hubs in Lissabon und Hamburg triffst Du auf Menschen aus aller Welt, verschiedene Kulturen, Farben, Sprachen, Geschlechter und Lebensstile. Wir lieben Vielfalt und Offenheit.\n\nWenn man irgendjemanden fragt, warum er hier arbeitet, ist es ziemlich wahrscheinlich, dass die Antwort \"wegen der Menschen\" und \"weil ich in meinem Leben noch nie so viel gelernt habe\" ist. Unser Unternehmen ist ein Ort, an dem man man selbst sein kann, sich hohe Ziele setzt, sich umeinander kümmert und grenzenlos wachsen kann.\n\nIn unseren zentral gelegenen Büros trifft sich unsere Community nicht nur, um zu arbeiten, sondern auch zum Billardspielen und zum Spaßhaben mit den Teammitgliedern. \n\nViel wichtiger aber ist, dass wir Dir die Möglichkeit bieten, mit intelligenten Menschen an interessanten Aufgaben zu arbeiten und Projekte von der Idee bis zur Umsetzung eigenverantwortlich zu realisieren.\n\nDAZUGEHÖREN?\n\nDann schicke uns Deine vollständigen Bewerbungsunterlagen (Lebenslauf und Zeugnisse) über unser Bewerberportal. Und bei Fragen zu Deiner Bewerbung oder dem Bewerbungsprozess steht Dir Lena Oechtering unter +49 40/890584-0 persönlich zur Verfügung.\n\nPrivacy Policy\n","additional":"<div><b style=\"font-size: 12pt\">ÜBER UNSERE COMMUNITY</b></div><div><br></div><div><span style=\"font-size: 12pt\">In unseren Engineering Hubs in Lissabon und Hamburg triffst Du auf Menschen aus aller Welt, verschiedene Kulturen, Farben, Sprachen, Geschlechter und Lebensstile. Wir lieben Vielfalt und Offenheit.</span></div><div><br></div><div><span style=\"font-size: 12pt\">Wenn man irgendjemanden fragt, warum er hier arbeitet, ist es ziemlich wahrscheinlich, dass die Antwort \"wegen der Menschen\" und \"weil ich in meinem Leben noch nie so viel gelernt habe\" ist. Unser Unternehmen ist ein Ort, an dem man man selbst sein kann, sich hohe Ziele setzt, sich umeinander kümmert und grenzenlos wachsen kann.</span></div><div><br></div><div><span style=\"font-size: 12pt\">In unseren zentral gelegenen Büros trifft sich unsere Community nicht nur, um zu arbeiten, sondern auch zum Billardspielen und zum Spaßhaben mit den Teammitgliedern.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 12pt\">Viel wichtiger aber ist, dass wir Dir die Möglichkeit bieten, mit intelligenten Menschen an interessanten Aufgaben zu arbeiten und Projekte von der Idee bis zur Umsetzung eigenverantwortlich zu realisieren.</span></div><div><br></div><div><b style=\"font-size: 12pt\">DAZUGEHÖREN?</b></div><div><br></div><div><span style=\"font-size: 12pt\">Dann schicke uns Deine vollständigen Bewerbungsunterlagen (Lebenslauf und Zeugnisse) über unser Bewerberportal. Und bei Fragen zu Deiner Bewerbung oder dem Bewerbungsprozess steht Dir Lena Oechtering unter +49 40/890584-0 persönlich zur Verfügung.</span></div><div><br></div><div><a href=\"https://freiheit.com/privacy_policy/#lever\" class=\"postings-link\">Privacy Policy</a></div>","categories":{"commitment":"Full-time","location":"Hamburg","team":"People, Commercial and Organization"},"createdAt":1668704451382,"descriptionPlain":"ÜBER UNSERE COMPANY\n\nfreiheit.com entwickelt seit 1999 hochverfügbare und skalierbare Software-Systeme. Wir sind Internet-Pioniere und haben für unsere Kunden bereits Hunderte von Projekten realisiert, die von Millionen von Nutzern mit Tausenden von Anfragen pro Sekunde genutzt werden.\n\nWir arbeiten dabei sowohl für erfolgreiche Mittelständler als auch für das “Who's Who” der deutschen Industrie - und quer über alle Branchen. Handel, Automotive, E-Commerce, Energy - bei den Projekten für unsere Kunden sind wir immer bereit, Neues zu lernen. \n\nIn den letzten zwei Jahrzehnten haben wir uns ständig neu erfunden. Selbstverbesserung und Lernen sind tief in der DNA unseres Unternehmens und in der Persönlichkeit aller unserer Teammitglieder verwurzelt. Wir gehen ständig neue und interessante Probleme an und erarbeiten sehr häufig Lösungen, die es so zuvor noch nicht gegeben hat.\n\nWir sind eine außergewöhnliche, innovative und leistungsstarke Engineering Company. 85 % unserer Kolleginnen und Kollegen sind Engineers mit einem Hintergrund in Informatik, Physik oder Mathematik. Viele von ihnen haben einen Machine-Learning-Background.\n","description":"<div><b style=\"font-size: 12pt\">ÜBER UNSERE COMPANY</b></div><div><br></div><div><span style=\"font-size: 12pt\">freiheit.com entwickelt seit 1999 hochverfügbare und skalierbare Software-Systeme. Wir sind Internet-Pioniere und haben für unsere Kunden bereits Hunderte von Projekten realisiert, die von Millionen von Nutzern mit Tausenden von Anfragen pro Sekunde genutzt werden.</span></div><div><br></div><div><span style=\"font-size: 12pt\">Wir arbeiten dabei sowohl für erfolgreiche Mittelständler als auch für das “Who's Who” der deutschen Industrie - und quer über alle Branchen. Handel, Automotive, E-Commerce, Energy - bei den Projekten für unsere Kunden sind wir immer bereit, Neues zu lernen.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 12pt\">In den letzten zwei Jahrzehnten haben wir uns ständig neu erfunden. Selbstverbesserung und Lernen sind tief in der DNA unseres Unternehmens und in der Persönlichkeit aller unserer Teammitglieder verwurzelt. Wir gehen ständig neue und interessante Probleme an und erarbeiten sehr häufig Lösungen, die es so zuvor noch nicht gegeben hat.</span></div><div><br></div><div><span style=\"font-size: 12pt\">Wir sind eine außergewöhnliche, innovative und leistungsstarke Engineering Company. 85 % unserer Kolleginnen und Kollegen sind Engineers mit einem Hintergrund in Informatik, Physik oder Mathematik. Viele von ihnen haben einen Machine-Learning-Background.</span></div>","id":"0799eacf-dc66-4f4c-b90f-0b9823cb7b6b","lists":[{"text":"ÜBER DEINEN JOB","content":"<li>Als Personal Assistant arbeitest Du in einem hochagilen Umfeld eng mit dem Vice President Engineering und dem Vice President Business von <a href=\"http://freiheit.com\" class=\"postings-link\">freiheit.com</a> zusammen. </li><li>Du verstehst ihre jeweiligen Ziele und hältst dem Team den Rücken frei, d. h. Du koordinierst Termine mit Kunden, Partnern und Dienstleistern.&nbsp;Du planst und buchst anstehende Reisen, übernimmst deren Abrechnung und unterstützt ganz allgemein das VP-Team in der “day-to-day” Arbeitsorganisation.</li><li>Du sorgst dafür, dass alle Dokumente, die wir mit Kunden oder Partnern teilen, absolut fehlerfrei sind.&nbsp;Darüber hinaus organisierst Du Events rund um die Entwicklungsteams zusammen mit dem Community &amp; Office Team. </li><li>Du verwaltest für und mit dem VP-Team Budgets und behältst deren Einhaltung im Fokus.&nbsp;</li><li>Du hast die wichtigsten ToDos der VPs im Blick und erinnerst sie bei Bedarf an die jeweiligen Deadlines.&nbsp;</li>"},{"text":"ÜBER DICH","content":"<li>Du bist als erster Kontaktpunkt für unsere Kunden kommunikationsstark auf Deutsch und Englisch - persönlich, schriftlich und am Telefon. Du hast eine positive Ausstrahlung und verstehst Dich als Unterstützer/in des VP-Teams. Du bist Ansprechpartner für Deine Kollegen und stehst ihnen bei Fragen freundlich und hilfsbereit zur Verfügung.&nbsp;</li><li>Du bist sicher in Lektorat und Formatierung aller Präsentationen und Dokumente, die unser Haus verlassen. Dafür hast Du ausreichend Erfahrung mit den gängigen Office-Programmen.</li><li>Du bringst eine abgeschlossene kaufmännische Ausbildung oder eine ähnliche Qualifikation mit. Du bist sicher im Einsatz der gängigen Tabellen- und Datenbank-Anwendungen.&nbsp;Deine vorhandene Erfahrung als Personal Assistant haben Dich gelehrt, auch in turbulenten Situationen einen kühlen Kopf zu bewahren.</li><li>Du zeichnest Dich durch eine selbstständige Arbeitsweise aus und gehst Herausforderungen proaktiv und lösungsorientiert an.</li><li>Du gehst sehr sorgfältig und strukturiert vor, kannst aber auch schnell Entscheidungen treffen, wenn es notwendig ist.</li><li>Du hilfst Strukturen und Prozesse einzuhalten und erkennst auch neue Wege, um effektiver zu werden.</li><li>Du bist bereit, jeden Tag etwas Neues zu lernen und Dich weiterzuentwickeln. </li><li>Du hast Spaß am Mitdenken und Mitentscheiden. Du nimmst Herausforderungen an, ohne die Risiken aus dem Auge zu verlieren. Du bist ehrlich und hast Humor. Du bist mitreißend, charmant und durchsetzungsstark. Du willst nicht irgendeinen Job, sondern Du willst mit Deinen Ideen und Deinem Können etwas bewegen.</li>"}],"text":"Personal Assistant to Vice President Engineering & Business (m/w/d)","country":"DE","workplaceType":"hybrid","hostedUrl":"https://jobs.lever.co/freiheit-2/0799eacf-dc66-4f4c-b90f-0b9823cb7b6b","applyUrl":"https://jobs.lever.co/freiheit-2/0799eacf-dc66-4f4c-b90f-0b9823cb7b6b/apply"},{"additionalPlain":"ÜBER UNSER COMMUNITY\n\nIn unseren Engineering Hubs in Hamburg und Lissabon triffst Du auf Menschen aus aller Welt, verschiedene Kulturen, Farben, Sprachen, Geschlechter und Lebensstile. Wir lieben Vielfalt und Offenheit.\n\nWenn man irgendjemanden fragt, warum er hier arbeitet, ist es ziemlich wahrscheinlich, dass die Leute sagen werden \"wegen der Menschen\" und \"weil ich in meinem Leben noch nie so viel gelernt habe\". Unser Unternehmen ist ein Ort, an dem man man selbst sein kann, sich hohe Ziele setzt, sich umeinander kümmert und grenzenlos wachsen kann.\n\nIn unseren zentral gelegenen Büros trifft sich unsere Community nicht nur, um zu arbeiten, sondern auch zum Billardspielen und zum Spaßhaben mit den Teammitgliedern. \n\nViel wichtiger aber ist, dass wir Dir die Möglichkeit geben, mit intelligenten Menschen an interessanten Aufgaben zu arbeiten und ein komplettes Projekt von der Idee bis zur Umsetzung eigenverantwortlich zu realisieren.\n\nDAZUGEHÖREN?\n\nDann schicke uns Deine vollständigen Bewerbungsunterlagen (Lebenslauf und Zeugnisse) über unser Bewerberportal. Und bei Fragen zu Deiner Bewerbung oder dem Bewerbungsprozess steht Dir Lena Oechtering unter +49 40/890584-0 persönlich zur Verfügung.\n\n","additional":"<div><b style=\"font-size: 11pt\">ÜBER UNSER COMMUNITY</b></div><div><br></div><div><span style=\"font-size: 11pt\">In unseren Engineering Hubs in Hamburg und Lissabon triffst Du auf Menschen aus aller Welt, verschiedene Kulturen, Farben, Sprachen, Geschlechter und Lebensstile. Wir lieben Vielfalt und Offenheit.</span></div><div><br></div><div><span style=\"font-size: 11pt\">Wenn man irgendjemanden fragt, warum er hier arbeitet, ist es ziemlich wahrscheinlich, dass die Leute sagen werden \"wegen der Menschen\" und \"weil ich in meinem Leben noch nie so viel gelernt habe\". Unser Unternehmen ist ein Ort, an dem man man selbst sein kann, sich hohe Ziele setzt, sich umeinander kümmert und grenzenlos wachsen kann.</span></div><div><br></div><div><span style=\"font-size: 11pt\">In unseren zentral gelegenen Büros trifft sich unsere Community nicht nur, um zu arbeiten, sondern auch zum Billardspielen und zum Spaßhaben mit den Teammitgliedern.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">Viel wichtiger aber ist, dass wir Dir die Möglichkeit geben, mit intelligenten Menschen an interessanten Aufgaben zu arbeiten und ein komplettes Projekt von der Idee bis zur Umsetzung eigenverantwortlich zu realisieren.</span></div><div><br></div><div><b style=\"font-size: 11pt\">DAZUGEHÖREN?</b></div><div><br></div><div><span style=\"font-size: 11pt\">Dann schicke uns Deine vollständigen Bewerbungsunterlagen (Lebenslauf und Zeugnisse) über unser Bewerberportal. Und bei Fragen zu Deiner Bewerbung oder dem Bewerbungsprozess steht Dir Lena Oechtering unter +49 40/890584-0 persönlich zur Verfügung.</span></div><div><br></div>","categories":{"commitment":"Full-time","location":"Hamburg","team":"People, Commercial and Organization"},"createdAt":1687938789023,"descriptionPlain":"ÜBER UNSERE COMPANY:\n\nfreiheit.com ist seit 1999 Premiumanbieter digitaler Softwareprodukte für namhafte internationale Kunden. Unsere Produkte werden von Millionen von Usern mit tausenden von Anfragen pro Sekunde genutzt. Seit über 24 Jahren arbeiten wir für das „Who's Who“ der deutschen und europäischen Industrie und Wirtschaft – quer über alle Branchen. Handel, Automotive, E-Commerce, Healthcare etc.\n\nAlle Produkte haben für unsere Kunden eine sehr hohe strategische Relevanz und sind daher maßgeblich für ihren wirtschaftlichen Erfolg. Failure is not an option. Wir sind bekannt für unsere hohe Reputation am Markt und als Arbeitgeber sehr geschätzt aufgrund des starken Zusammenhalts unserer einzigartigen Community.\n\nFür die nächsten Jahre haben wir ambitionierte Wachstumsziele und bauen deshalb unser internationales Team aus.\n\nAls Teil unseres engagierten Teams wirst du eine zentrale Rolle bei der Entwicklung und Umsetzung unserer visuellen Inhalte spielen. Wenn du nach einer spannenden Herausforderung suchst, in der du Deine Leidenschaft für Videoproduktion, Bildbearbeitung und Grafikdesign ausleben kannst, freuen wir uns darauf, Dich in unserem Team willkommen zu heißen.\n\n","description":"<div><b style=\"font-size: 11pt\">ÜBER UNSERE COMPANY:</b></div><div><br></div><div><span style=\"font-size: 12pt\">freiheit.com ist seit 1999 Premiumanbieter digitaler Softwareprodukte für namhafte internationale Kunden. Unsere Produkte werden von Millionen von Usern mit tausenden von Anfragen pro Sekunde genutzt. Seit über 24 Jahren arbeiten wir für das „Who's Who“ der deutschen und europäischen Industrie und Wirtschaft – quer über alle Branchen. Handel, Automotive, E-Commerce, Healthcare etc.</span></div><div><br></div><div><span style=\"font-size: 12pt\">Alle Produkte haben für unsere Kunden eine sehr hohe strategische Relevanz und sind daher maßgeblich für ihren wirtschaftlichen Erfolg. Failure is not an option. Wir sind bekannt für unsere hohe Reputation am Markt und als Arbeitgeber sehr geschätzt aufgrund des starken Zusammenhalts unserer einzigartigen Community.</span></div><div><br></div><div><span style=\"font-size: 12pt\">Für die nächsten Jahre haben wir ambitionierte Wachstumsziele und bauen deshalb unser internationales Team aus.</span></div><div><br></div><div><span style=\"font-size: 12pt\">Als Teil unseres engagierten Teams wirst du eine zentrale Rolle bei der Entwicklung und Umsetzung unserer visuellen Inhalte spielen. Wenn du nach einer spannenden Herausforderung suchst, in der du Deine Leidenschaft für Videoproduktion, Bildbearbeitung und Grafikdesign ausleben kannst, freuen wir uns darauf, Dich in unserem Team willkommen zu heißen.</span></div><div><br></div>","id":"c1234a36-b145-4c1d-9a95-e06445fcf0ad","lists":[{"text":"ÜBER DEINEN JOB","content":"<li>Mit Deinem kreativen Blick und technischen Fähigkeiten drehst, schneidest und bearbeitest Du Videos, um mitreißenden Content zu kreieren und hilfst uns dabei, unsere Geschichte zu erzählen. Von Anfang bis Ende bist Du in den gesamten Produktionsprozess eingebunden. </li><li>Vom Briefing über den Dreh bis hin zur fertigen Bearbeitung und Veröffentlichung eines Videos trägst Du eigenverantwortlich dazu bei, dass jeder einzelne Schritt ein Erfolg wird. </li><li>Als wahrer Profi sorgst Du dafür, dass das benötigte Dreh-Equipment zur richtigen Zeit am richtigen Ort verfügbar ist.</li><li>Du überwachst und analysierst die Performance unserer Videos, um kontinuierlich die Qualität und Relevanz unserer Videoformate zu verbessern.</li><li>Gemeinsam mit einem engagierten Team arbeitest Du an der Konzeption innovativer Videoformate oder auch Podcasts für verschiedene Kommunikationskanäle.</li><li>Mit deinem Gespür für unsere Zielgruppen und deinen Fähigkeiten in der Postproduktion verleihst Du unseren Videos den letzten Schliff, sei es beim Videoschnitt, der 2D-Animation oder der Integration von beeindruckenden Motion Graphics.</li>"},{"text":"ÜBER DICH","content":"<li>Du hast ein erfolgreich abgeschlossenes Hochschulstudium im Bereich Film, Design, Medien oder Videojournalismus. Vielleicht bist Du YouTuber und bereit, aus Deiner Leidenschaft einen Beruf zu machen.</li><li>Du hast bereits Kenntnisse in der Video-Konzeption und -umsetzung, einschließlich Schnitt mit gängigen Tools wie After Effects, Premiere, Photoshop etc.</li><li>Du hast ein Verständnis für verschiedene Social-Media-Plattformen wie YouTube, und LinkedIn und die Fähigkeit, zielgruppengerechten Video-Content zu erstellen.</li><div><br></div>"}],"text":"Videographer / Content Creator (m/w/d)","country":"DE","workplaceType":"hybrid","hostedUrl":"https://jobs.lever.co/freiheit-2/c1234a36-b145-4c1d-9a95-e06445fcf0ad","applyUrl":"https://jobs.lever.co/freiheit-2/c1234a36-b145-4c1d-9a95-e06445fcf0ad/apply"}]},{"title":"Lisbon","postings":[{"additionalPlain":"ABOUT OUR COMMUNITY\n\nIn our Engineering Hubs in Hamburg and Lisbon you will meet people from all over the world, different cultures, colors, languages, genders and lifestyles. We celebrate diversity and openness. \n\nWhen you ask anybody why they are working here, it is pretty likely that people will say “because of the people” and “because I have never learnt so much in my life”. Our company is a place to be yourself, aim high, taking care of each other and growing without limits.\n\n\n\nOf course we have a beautiful office in a very nice area of each city, a place to hang-out and play pool and have fun with your team members. But more important is that we offer you the ability to work on interesting things and owning a complete large-scale project from idea to implementation and operations. You have the opportunity to learn from senior engineers, work in a well-organized and well-managed company and start a fulfilling career in tech.\n\nP.S.: Although we visit our customers regularly, all team members are working mainly from Hamburg or Lisbon and not on the customers’ premises.\n\nDO YOU WANT TO BE PART OF OUR TEAM?\n\nThen send us your complete application documents (curriculum vitae and references) via email or our application portal. And if you have any questions about your application or the application process, Lena Oechtering is available to you personally on +49 40/890584-0.\n\n\nPrivacy policy\n","additional":"<div><span style=\"font-size: 24px\">ABOUT OUR COMMUNITY</span></div><div><br></div><div>In our Engineering Hubs in Hamburg and Lisbon you will meet people from all over the world, different cultures, colors, languages, genders and lifestyles. We celebrate diversity and openness.&nbsp;</div><div><br></div><div>When you ask anybody why they are working here, it is pretty likely that people will say “because of the people” and “because I have never learnt so much in my life”. Our company is a place to be yourself, aim high, taking care of each other and growing without limits.</div><div><br></div><div><br></div><div><br></div><div>Of course we have a beautiful office in a very nice area of each city, a place to hang-out and play pool and have fun with your team members. But more important is that we offer you the ability to work on interesting things and owning a complete large-scale project from idea to implementation and operations. You have the opportunity to learn from senior engineers, work in a well-organized and well-managed company and start a fulfilling career in tech.</div><div><br></div><div>P.S.: Although we visit our customers regularly, all team members are working mainly from Hamburg or Lisbon and not on the customers’ premises.</div><div><br></div><div><span style=\"font-size: 24px\">DO YOU WANT TO BE PART OF OUR TEAM?</span></div><div><br></div><div>Then send us your complete application documents (curriculum vitae and references) via email or our application portal. And if you have any questions about your application or the application process, Lena Oechtering is available to you personally on +49 40/890584-0.</div><div><br></div><div><br></div><div><a href=\"https://freiheit.com/privacy_policy/#lever\" class=\"postings-link\">Privacy policy</a></div>","categories":{"commitment":"Full-time","location":"Lisbon","team":"Engineers"},"createdAt":1592481919378,"descriptionPlain":"ABOUT OUR COMPANY\n\nfreiheit.com’s software engineers have been building large-scale software systems since 1999. We are internet pioneers and we have delivered hundreds of projects for our customers that are used by millions of users with thousands of requests per second since then. \n\nIn the last two decades we have been constantly reinventing and improving ourselves. Self-Improvement and learning are deeply ingrained into our company's DNA and in the personality of all of our team members. We tackle new and interesting problems all the time and very often create things that nobody has built before. \n\nAt heart we are an unusual, innovative and bold engineering company. 85% of our people are engineers with backgrounds in Computer Science, Physics or Mathematics, many also with strong machine learning backgrounds. We hire the top ranking students directly from university or from their first work experience and actively develop them to become well-rounded software engineers. \n\nFrom our Engineering Hubs in Hamburg and Lisbon we work for large and mid-sized companies to reinvent their future with technology. \n\n\nABOUT YOUR JOB\n\n·\tYou start in one of our engineering teams. Team size is maximum five people.\n·\tYou will receive a lot of introductory training in the first weeks about the technologies you are going to use in your project. \n·\tThe trainings are conducted by software engineers from our own company.\n·\tYou are involved in every part of the software engineering process and in the lifecycle of the services that your team is building - design,   \n    development, testing, deployment, maintenance, operations and improving software based on user feedback and usage data.\n· \tYou work closely with our customers to iteratively improve their product offering by conceiving, refining and delivering new ideas.\n\n\nABOUT YOU\n\nQualifications:\n\n·\tBachelor’s degree in Computer Science or related fields like Mathematics or Physics\n·\tExperience in C/C++, Python or Java\n·\tAbility to learn fast \n·\tAlgorithms and data structures, understanding time & space complexity\n·\t5+ years of experience as a software engineer (writing code every day)\n·\tWorked in teams of at least five members\n·\tDelivered 2-3 projects from first line of code to production launch\n·\tStayed on at least 1-2 years in each team/project\n·\tHigh influence on the technical success of their past projects\n\nBonus skills or interests:\n\n·\tMaster or PhD in Computer Science or related fields like Mathematics or Physics\n·\tExperience in Go, Kotlin, TypeScript or JavaScript\n·\tExperience in front end development, like ReactJS, Angular, Vue or Flutter/Dart\n·  Functional programming with Common Lisp, Clojure or Haskell\n·\tExperience working with distributed systems in the Cloud\n·\tExperience in Machine Learning and Data Science\n·\tCompetitive Programming\n","description":"<div><span style=\"font-size: 24px\">ABOUT OUR COMPANY</span></div><div><br></div><div>freiheit.com’s software engineers have been building large-scale software systems since 1999. We are internet pioneers and we have delivered hundreds of projects for our customers that are used by millions of users with thousands of requests per second since then. </div><div><br></div><div>In the last two decades we have been constantly reinventing and improving ourselves. Self-Improvement and learning are deeply ingrained into our company's DNA and in the personality of all of our team members. We tackle new and interesting problems all the time and very often create things that nobody has built before. </div><div><br></div><div>At heart we are an unusual, innovative and bold engineering company. 85% of our people are engineers with backgrounds in Computer Science, Physics or Mathematics, many also with strong machine learning backgrounds. We hire the top ranking students directly from university or from their first work experience and actively develop them to become well-rounded software engineers. </div><div><br></div><div>From our Engineering Hubs in Hamburg and Lisbon we work for large and mid-sized companies to reinvent their future with technology. </div><div><br></div><div><br></div><div><span style=\"font-size: 24px\">ABOUT YOUR JOB</span></div><div><br></div><div><b style=\"font-size: 14pt\">·</b>\tYou start in one of our engineering teams. Team size is maximum five people.</div><div><b style=\"font-size: 14pt\">·</b>\tYou will receive a lot of introductory training in the first weeks about the technologies you are going to use in your project. </div><div><b style=\"font-size: 14pt\">·</b>\tThe trainings are conducted by software engineers from our own company.</div><div><b style=\"font-size: 14pt\">·</b>\tYou are involved in every part of the software engineering process and in the lifecycle of the services that your team is building - design,   </div><div>    development, testing, deployment, maintenance, operations and improving software based on user feedback and usage data.</div><div><b style=\"font-size: 14pt\">· </b>\tYou work closely with our customers to iteratively improve their product offering by conceiving, refining and delivering new ideas.</div><div><br></div><div><br></div><div><span style=\"font-size: 24px\">ABOUT YOU</span></div><div><br></div><div>Qualifications:</div><div><br></div><div><b style=\"font-size: 14pt\">·</b>\tBachelor’s degree in Computer Science or related fields like Mathematics or Physics</div><div><b style=\"font-size: 14pt\">·</b>\tExperience in C/C++, Python or Java</div><div><b style=\"font-size: 14pt\">·</b>\tAbility to learn fast&nbsp;</div><div><b style=\"font-size: 14pt\">·</b>\tAlgorithms and data structures, understanding time &amp; space complexity</div><div><b style=\"font-size: 14pt\">·</b>\t5+ years of experience as a software engineer (writing code every day)</div><div><b style=\"font-size: 14pt\">·</b>\tWorked in teams of at least five members</div><div><b style=\"font-size: 14pt\">·</b>\tDelivered 2-3 projects from first line of code to production launch</div><div><b style=\"font-size: 14pt\">·</b>\tStayed on at least 1-2 years in each team/project</div><div><b style=\"font-size: 14pt\">·</b>\tHigh influence on the technical success of their past projects</div><div><br></div><div>Bonus skills or interests:</div><div><br></div><div><b style=\"font-size: 14pt\">·</b>\tMaster or PhD in Computer Science or related fields like Mathematics or Physics</div><div><b style=\"font-size: 14pt\">·</b>\tExperience in Go, Kotlin, TypeScript or JavaScript</div><div><b style=\"font-size: 14pt\">·</b>\tExperience in front end development, like ReactJS, Angular, Vue or Flutter/Dart</div><div><b style=\"font-size: 14pt\">·  </b>Functional programming with Common Lisp, Clojure or Haskell</div><div><b style=\"font-size: 14pt\">·</b>\tExperience working with distributed systems in the Cloud</div><div><b style=\"font-size: 14pt\">·</b>\tExperience in Machine Learning and Data Science</div><div><b style=\"font-size: 14pt\">·</b>\tCompetitive Programming</div>","id":"8edd3ac5-cf10-4dfe-927b-8e7c31f78d9d","lists":[],"text":"Hackers wanted – Senior Software Engineer (m/f/d)","country":"PT","workplaceType":"hybrid","hostedUrl":"https://jobs.lever.co/freiheit-2/8edd3ac5-cf10-4dfe-927b-8e7c31f78d9d","applyUrl":"https://jobs.lever.co/freiheit-2/8edd3ac5-cf10-4dfe-927b-8e7c31f78d9d/apply"},{"additionalPlain":"ABOUT OUR COMMUNITY\n\nIn our Engineering Hubs in Hamburg and Lisbon you will meet people from all over the world, different cultures, colors, languages, genders and lifestyles. We celebrate diversity and openness. \n\nWhen you ask anybody why they are working here, it is pretty likely that people will say “because of the people” and “because I have never learnt so much in my life”. Our company is a place to be yourself, aim high, taking care of each other and growing without limits.\n\nOf course we have a beautiful office in a very nice area of each city, a place to hang-out and play pool and have fun with your team members. But more important is that we offer you the ability to work on interesting things and owning a complete large-scale project from idea to implementation and operations. You have the opportunity to learn from senior engineers, work in a well-organized and well-managed company and start a fulfilling career in tech.\n\nP.S.: Although we visit our customers regularly, all team members are working mainly from Hamburg or Lisbon and not on the customers’ premises.\n\n\nDO YOU WANT TO BE PART OF OUR TEAM?\n\nThen send us your complete application documents (curriculum vitae and references) via email or our application portal. And if you have any questions about your application or the application process, Lena or Jessica are available to you personally on +49 40/890584-0.\n\n\nPrivacy policy\n","additional":"<div><span style=\"font-size: 24px\">ABOUT OUR COMMUNITY</span></div><div><br></div><div>In our Engineering Hubs in Hamburg and Lisbon you will meet people from all over the world, different cultures, colors, languages, genders and lifestyles. We celebrate diversity and openness.&nbsp;</div><div><br></div><div>When you ask anybody why they are working here, it is pretty likely that people will say “because of the people” and “because I have never learnt so much in my life”. Our company is a place to be yourself, aim high, taking care of each other and growing without limits.</div><div><br></div><div>Of course we have a beautiful office in a very nice area of each city, a place to hang-out and play pool and have fun with your team members. But more important is that we offer you the ability to work on interesting things and owning a complete large-scale project from idea to implementation and operations. You have the opportunity to learn from senior engineers, work in a well-organized and well-managed company and start a fulfilling career in tech.</div><div><br></div><div>P.S.: Although we visit our customers regularly, all team members are working mainly from Hamburg or Lisbon and not on the customers’ premises.</div><div><br></div><div><br></div><div><span style=\"font-size: 24px\">DO YOU WANT TO BE PART OF OUR TEAM?</span></div><div><br></div><div>Then send us your complete application documents (curriculum vitae and references) via email or our application portal. And if you have any questions about your application or the application process, Lena or Jessica are available to you personally on +49 40/890584-0.</div><div><br></div><div><br></div><div><a href=\"https://freiheit.com/privacy_policy/#lever\" class=\"postings-link\">Privacy policy</a></div>","categories":{"commitment":"Full-time","location":"Lisbon","team":"Engineers"},"createdAt":1592481610736,"descriptionPlain":"ABOUT OUR COMPANY\n\nfreiheit.com’s software engineers have been building large-scale software systems since 1999. We are internet pioneers and we have delivered hundreds of projects for our customers that are used by millions of users with thousands of requests per second since then.\n\nIn the last two decades we have been constantly reinventing and improving ourselves. Self-Improvement and learning are deeply ingrained into our company's DNA and in the personality of all of our team members. We tackle new and interesting problems all the time and very often create things that nobody has built before.\n\nAt heart we are an unusual, innovative and bold engineering company. 85% of our people are engineers with backgrounds in Computer Science, Physics or Mathematics, many also with strong machine learning backgrounds.\n\nWe hire the top ranking students directly from university or from their first work experience and actively develop them to become well-rounded software engineers.\n\nFrom our Engineering Hubs in Hamburg and Lisbon we work for large and mid-sized companies to reinvent their future with technology. \n\n\nABOUT YOUR JOB\n\n·\tYou start in one of our engineering teams. Team size is maximum five people.\n·\tYou will receive a lot of introductory training in the first weeks about the technologies you are going to use in your project.                                The trainings are conducted by software engineers from our own company.\n·\tYou are involved in every part of the software engineering process and in the lifecycle of the services that your team is building -             design, development, testing, deployment, maintenance, operations and improving software based on user feedback and usage data.\n·\tYou work closely with our customers to iteratively improve their product offering by conceiving, refining and delivering new ideas.\n\n\nABOUT YOU\n\nQualifications:\n\n·\tBachelor’s degree in Computer Science or related fields like Mathematics or Physics\n·\tExperience in Go, C/C++, Python or Java\n·\tAbility to learn fast \n\nBonus skills or interests:\n\n·\tMaster or PhD in Computer Science or related fields like Mathematics or Physics\n·\tAlgorithms and data structures, understanding time & space complexity\n·\tExperience in Kotlin, TypeScript or JavaScript\n·\tExperience in front end development, like ReactJS, Angular, Vue or Flutter/Dart\n·\tFunctional programming with Common Lisp, Clojure or Haskell\n·\tExperience working with distributed systems in the Cloud\n·\tExperience in Machine Learning and Data Science\n·\tCompetitive Programming\n","description":"<div><span style=\"font-size: 24px\">ABOUT OUR COMPANY</span></div><div><br></div><div>freiheit.com’s software engineers have been building large-scale software systems since 1999. We are internet pioneers and we have delivered hundreds of projects for our customers that are used by millions of users with thousands of requests per second since then.</div><div><br></div><div>In the last two decades we have been constantly reinventing and improving ourselves. Self-Improvement and learning are deeply ingrained into our company's DNA and in the personality of all of our team members. We tackle new and interesting problems all the time and very often create things that nobody has built before.</div><div><br></div><div>At heart we are an unusual, innovative and bold engineering company. 85% of our people are engineers with backgrounds in Computer Science, Physics or Mathematics, many also with strong machine learning backgrounds.</div><div><br></div><div>We hire the top ranking students directly from university or from their first work experience and actively develop them to become well-rounded software engineers.</div><div><br></div><div>From our Engineering Hubs in Hamburg and Lisbon we work for large and mid-sized companies to reinvent their future with technology.&nbsp;</div><div><br></div><div><br></div><div><span style=\"font-size: 24px\">ABOUT YOUR JOB</span></div><div><br></div><div><b style=\"font-size: 14pt\">·</b>\tYou start in one of our engineering teams. Team size is maximum five people.</div><div><b style=\"font-size: 14pt\">·</b>\tYou will receive a lot of introductory training in the first weeks about the technologies you are going to use in your project.                                The trainings are conducted by software engineers from our own company.</div><div><b style=\"font-size: 14pt\">·</b>\tYou are involved in every part of the software engineering process and in the lifecycle of the services that your team is building -             design, development, testing, deployment, maintenance, operations and improving software based on user feedback and usage data.</div><div><b style=\"font-size: 14pt\">·</b>\tYou work closely with our customers to iteratively improve their product offering by conceiving, refining and delivering new ideas.</div><div><br></div><div><br></div><div><span style=\"font-size: 24px\">ABOUT YOU</span></div><div><br></div><div>Qualifications:</div><div><br></div><div><b style=\"font-size: 14pt\">·</b>\tBachelor’s degree in Computer Science or related fields like Mathematics or Physics</div><div><b style=\"font-size: 14pt\">·</b>\tExperience in Go, C/C++, Python or Java</div><div><b style=\"font-size: 14pt\">·</b>\tAbility to learn fast&nbsp;</div><div><br></div><div>Bonus skills or interests:</div><div><br></div><div><b style=\"font-size: 14pt\">·</b>\tMaster or PhD in Computer Science or related fields like Mathematics or Physics</div><div><b style=\"font-size: 14pt\">·</b>\tAlgorithms and data structures, understanding time &amp; space complexity</div><div><b style=\"font-size: 14pt\">·</b>\tExperience in Kotlin, TypeScript or JavaScript</div><div><b style=\"font-size: 14pt\">·</b>\tExperience in front end development, like ReactJS, Angular, Vue or Flutter/Dart</div><div><b style=\"font-size: 14pt\">·</b>\tFunctional programming with Common Lisp, Clojure or Haskell</div><div><b style=\"font-size: 14pt\">·</b>\tExperience working with distributed systems in the Cloud</div><div><b style=\"font-size: 14pt\">·</b>\tExperience in Machine Learning and Data Science</div><div><b style=\"font-size: 14pt\">·</b>\tCompetitive Programming</div>","id":"075976eb-653f-4323-bdc1-7e1d32325372","lists":[],"text":"Hackers wanted – Software Engineers (m/f/d)","country":"PT","workplaceType":"hybrid","hostedUrl":"https://jobs.lever.co/freiheit-2/075976eb-653f-4323-bdc1-7e1d32325372","applyUrl":"https://jobs.lever.co/freiheit-2/075976eb-653f-4323-bdc1-7e1d32325372/apply"},{"additionalPlain":"ABOUT OUR COMMUNITY\n\nIn our engineering hubs in Hamburg and Lisbon, you will meet people from all over the world – different cultures, origins, languages, genders and lifestyles. We love diversity and openness.\n\nIf you ask anyone why they work here, it's pretty likely that they will say “because of the people” and “because I've never learned so much in my life”. Our company is a place where you can be yourself, aim high, care for each other and grow without limits.\n\nIn our centrally located offices, our community meets not only to work, but also to play pool and have fun with team members and find some new friends. \n\nWANT TO JOIN US?\n\nSend us your complete application (CV) via our applicant portal. If you have any questions about your application or the application process, please contact Lena Oechtering personally at +49 40/890584-0.\n\nPrivacy Policy\n","additional":"<div><b style=\"font-size: 11pt\">ABOUT OUR COMMUNITY</b></div><div><br></div><div><span style=\"font-size: 11pt\">In our engineering hubs in Hamburg and Lisbon, you will meet people from all over the world – different cultures, origins, languages, genders and lifestyles. We love diversity and openness.</span></div><div><br></div><div><span style=\"font-size: 11pt\">If you ask anyone why they work here, it's pretty likely that they will say “because of the people” and “because I've never learned so much in my life”. Our company is a place where you can be yourself, aim high, care for each other and grow without limits.</span></div><div><br></div><div><span style=\"font-size: 11pt\">In our centrally located offices, our community meets not only to work, but also to play pool and have fun with team members and find some new friends.&nbsp;</span></div><div><br></div><div><b style=\"font-size: 11pt\">WANT TO JOIN US?</b></div><div><br></div><div><span style=\"font-size: 11pt\">Send us your complete application (CV) via our applicant portal. If you have any questions about your application or the application process, please contact Lena Oechtering personally at +49 40/890584-0.</span></div><div><br></div><div><a href=\"https://freiheit.com/privacy_policy/#lever\" class=\"postings-link\">Privacy Policy</a></div>","categories":{"commitment":"Full-time","location":"Lisbon","team":"People, Commercial and Organization"},"createdAt":1678289874389,"descriptionPlain":"ABOUT OUR COMPANY\n\nfreiheit.com is an internet pioneer, founded in Hamburg in 1999 and developing digital online products for international clients. We have completed hundreds of projects. Our digital products are used by millions of users with thousands of requests per second. We are known for our high reputation in the market and highly valued as an employer for our strong and unique sense of community.\n\nFor over 24 years, we have been working for the “Who's Who” of German and European industrial and commercial companies – across all sectors. Trade, automotive, e-commerce, healthcare and more. We have ambitious targets for growth in the coming years and are therefore expanding our international team, especially in the commercial area.\n\nWe currently have a team of 200 people from 29 nations in our engineering hubs in Hamburg and Lisbon and are still growing over both hubs, especially in Lisbon. This growth will be reached together with the recruiting team through your hunger and dedication as a passionate recruiter.\n","description":"<div><b style=\"font-size: 11pt\">ABOUT OUR COMPANY</b></div><div><br></div><div><a href=\"http://freiheit.com\" style=\"font-size: 11pt\" class=\"postings-link\">freiheit.com</a><span style=\"font-size: 11pt\"> is an internet pioneer, founded in Hamburg in 1999 and developing digital online products for international clients. We have completed hundreds of projects. Our digital products are used by millions of users with thousands of requests per second. We are known for our high reputation in the market and highly valued as an employer for our strong and unique sense of community.</span></div><div><br></div><div><span style=\"font-size: 11pt\">For over 24 years, we have been working for the “Who's Who” of German and European industrial and commercial companies – across all sectors. Trade, automotive, e-commerce, healthcare and more. We have ambitious targets for growth in the coming years and are therefore expanding our international team, especially in the commercial area.</span></div><div><br></div><div><span style=\"font-size: 11pt\">We currently have a team of 200 people from 29 nations in our engineering hubs in Hamburg and Lisbon and are still growing over both hubs, especially in Lisbon. This growth will be reached together with the recruiting team through your hunger and dedication as a passionate recruiter.</span></div>","id":"e08ba176-5569-4738-84d8-0e076962930f","lists":[{"text":"ABOUT YOUR JOB","content":"<li>As a recruiter for our engineering hubs in Lisbon, you will work closely with your recruiting team. Together you will find the top 5 percent of software engineers and students worldwide who have the potential and the will to grow with us and develop into excellent full-stack engineers. Our community and our drive to constantly grow is what defines us. Therefore, not only skills are important, but also the culture fit.</li><li>You want to constantly improve yourself and your processes. You control your recruiting measures via a dashboard that gives you up-to-date information about success or possible improvements. Your goal is not to increase the applicant rate in absolute terms, but the conversion rate of incoming applicants. All measures against this are measured and optimized.</li><li>You have the coordination of the recruiting team and applicant management firmly in your hands. You ensure a positive experience for our applicants, regardless of whether they receive an answer to their letter, have a conversation on the phone or have even been invited for a personal interview. Each applicant reflects the same positive image of our community, where learning, sharing and personal growth are paramount.</li><li>You see active search as a way of addressing good colleagues personally, discreetly, respectfully and without being intrusive. You have experience of where to search and how to organize direct contact, then in the <a href=\"http://freiheit.com\" class=\"postings-link\">freiheit.com</a> style. It motivates you to set up this process and to continuously develop it further in order to turn it into a successful recruiting channel.</li><li>Due to your open and committed nature, you manage to build and maintain long-term and successful cooperations with universities, student groups and service providers.</li><li>You enjoy organizing events and trade fair appearances. On these occasions, you are a passionate ambassador of our unique culture.</li>"},{"text":"ABOUT YOU","content":"<li>You have successfully completed a university degree in the humanities, natural sciences or economics.</li><li>You have already gained professional experience in recruiting engineers in tech companies or startups.</li><li>You know the dos and don'ts of applicant management and active search.</li><li>Your Portuguese and English are fluent in speaking and writing.</li><li>You are good at networking and enjoy building lasting working relationships</li><li>You love to learn something new every day and like to grow beyond yourself. You are honest and have a sense of humor. You are intoxicating, charming and assertive. You don't want just any job, you want to make a difference and actively shape something with your ideas and your skills.</li>"}],"text":"Recruiter (m/f/d)","country":"PT","workplaceType":"hybrid","hostedUrl":"https://jobs.lever.co/freiheit-2/e08ba176-5569-4738-84d8-0e076962930f","applyUrl":"https://jobs.lever.co/freiheit-2/e08ba176-5569-4738-84d8-0e076962930f/apply"}]}]